{
  "3729": "Hold up. Rank #1. Do you understand what you're looking at? Top 10. THE top 10. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 Oh and brother? This is the #1 Alien Wojak in existence. The rarest Alien Wojak out of all 100. 👑 This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3707": "Hold up. Rank #2. Do you understand what you're looking at? Top 10. THE top 10. Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #2 out of 100 Alien Wojaks. Top 3 of its kind. Elite status within the base. That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3728": "Yo TangTard, let me stop you right there. #3 out of 4,200. Top 10 in the entire collection. Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #3 out of 100 Alien Wojaks. Top 3 of its kind. Elite status within the base. That Piccolo Turban adds solid value too. B-tier providence, but still above average. Born different, stays different. Winners win! 🍊👑",
  "3705": "Hold up. Rank #4. Do you understand what you're looking at? Top 10. THE top 10. Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #4 out of 100 Alien Wojaks - top 4% of all Alien Wojaks in the grove. That Piccolo Turban adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3703": "#5. I've been waiting for someone to pull up this one. Top 10 territory, bro. Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #5 out of 100 Alien Wojaks - top 5% of all Alien Wojaks in the grove. That Piccolo Turban adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3704": "#6. I've been waiting for someone to pull up this one. Top 10 territory, brother. Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 Among all 100 Alien Wojaks, this ranks #6. Top 10% of its own kind. That Piccolo Turban adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "3137": "Hold up. Rank #7. Do you understand what you're looking at? Top 10. THE top 10. Plus you've got Clown Nose - all S-tier providence. The pulp don't lie! Silicon Data Center + Terminator together - that's the Chia Tech combo. 32 total in the grove. Oh and brother? This is the #1 Baddie in existence. The rarest Baddie out of all 200. 👑 That Beanie adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4121": "#8. I've been waiting for someone to pull up this one. Top 10 territory, bro. Bepe Waifu + Aviators - only 2 NFTs share this combination. Less than 0.1% of the grove. Oh and bro? This is the #1 Bepe Waifu in existence. The rarest Bepe Waifu out of all 42. 👑 Worth the squeeze, bro. 🍊",
  "4186": "Yo TangTard, let me stop you right there. #9 out of 4,200. Top 10 in the entire collection. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Bepe Baddie + Cyber Shades - only 2 NFTs share this combination. Less than 0.1% of the grove. Oh and TangTard? This is the #1 Bepe Baddie in existence. The rarest Bepe Baddie out of all 42. 👑 That School Uniform adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3733": "#10. I've been waiting for someone to pull up this one. Top 10 territory, TangTard. Plus you've got El Presidente - all S-tier providence. The pulp don't lie! Vampire Teeth in Mom's Basement. Hasn't seen sunlight in months. Still plotting. Still winning. Only 10 NFTs in the collection have this combo. Worth the squeeze. 🍊 Oh and TangTard? This is the #1 Alien Soyjak in existence. The rarest Alien Soyjak out of all 80. 👑 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2157": "#11 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Pizza + Soy Hair. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Oh and bro? This is the #1 Soyjak in existence. The rarest Soyjak out of all 750. 👑 You stumbled onto something real here, bro. Winners win! 🍊👑",
  "4148": "Top 50 at rank #12. Let me break down why this Bepe Waifu matters. Here's what most people miss: Bepe Waifu + Prom Dress. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 And we're talking #2 out of 42 Bepe Waifus. Top 3 of its kind. Elite status within the base. That Prom Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4145": "#13 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Here's what most people miss: Bepe Waifu + $BEPE. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 And we're talking #3 out of 42 Bepe Waifus. Top 3 of its kind. Elite status within the base. That School Uniform adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3840": "Alright Neckbeard, #14 in the grove. That's top 50 - we're talking elite territory here. Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. Oh and Neckbeard? This is the #1 Alien Waifu in existence. The rarest Alien Waifu out of all 35. 👑 That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "4154": "Alright bro, #15 in the grove. That's top 50 - we're talking elite territory here. Aviators + Twin Braids. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 42 Bepe Waifus, this ranks #4. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4122": "Top 50 at rank #16. Let me break down why this Bepe Waifu matters. Plus you've got Bepe Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Bepe Waifu + Bepe Suit. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2160": "Alright Neckbeard, #17 in the grove. That's top 50 - we're talking elite territory here. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #2 out of 750 Soyjaks. Top 3 of its kind. Elite status within the base. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3779": "Alright Neckbeard, #18 in the grove. That's top 50 - we're talking elite territory here. Here's what most people miss: Alien Soyjak + NYSE Dump. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 And we're talking #2 out of 80 Alien Soyjaks. Top 3 of its kind. Elite status within the base. That Drac adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3936": "Top 50 at rank #19. Let me break down why this Bepe Wojak matters. Standard Cut + Hell. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Oh and brother? This is the #1 Bepe Wojak in existence. The rarest Bepe Wojak out of all 124. 👑 That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4137": "Alright TangTard, #20 in the grove. That's top 50 - we're talking elite territory here. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! Bepe Waifu + 3D Glasses. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4143": "#21 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Bepe Waifu + Cyber Shades - only 3 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. The pulp don't lie, Neckbeard. This one's worth the squeeze. 🍊",
  "4146": "#22 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Here's what most people miss: Bepe Waifu + Ninja Turtle Mask. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3879": "Top 50 at rank #23. Let me break down why this Alien Baddie matters. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Here's what most people miss: Alien Baddie + Pipe. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Oh and brother? This is the #1 Alien Baddie in existence. The rarest Alien Baddie out of all 35. 👑 That School Uniform adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3457": "#24 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! But check this - VR Headset + 2Pac Bandana together? Only ONE in existence. That's a true 1-of-1 combo right there. Oh and bro? This is the #1 Monkey Zoo in existence. The rarest Monkey Zoo out of all 200. 👑 I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "3843": "Top 50 at rank #25. Let me break down why this Alien Waifu matters. Aviators + Mermaid Waves. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! And we're talking #2 out of 35 Alien Waifus. Top 3 of its kind. Elite status within the base. That Prom Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4189": "#26 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Here's what most people miss: Bepe Baddie + Prom Dress. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 And we're talking #2 out of 42 Bepe Baddies. Top 3 of its kind. Elite status within the base. That Prom Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3769": "Top 50 at rank #27. Let me break down why this Alien Soyjak matters. Plus you've got Cyber Shades, El Presidente - all S-tier providence. The pulp don't lie! Cyber Shades + Standard Cut. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! And we're talking #3 out of 80 Alien Soyjaks. Top 3 of its kind. Elite status within the base. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4164": "Alright bro, #28 in the grove. That's top 50 - we're talking elite territory here. Route 66 + Born to Ride together - that's the Route 66 Rider combo. 71 total in the grove. And we're talking #3 out of 42 Bepe Baddies. Top 3 of its kind. Elite status within the base. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2883": "#29 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. Oh and TangTard? This is the #1 Waifu in existence. The rarest Waifu out of all 250. 👑 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4162": "Alright brother, #30 in the grove. That's top 50 - we're talking elite territory here. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Twin Braids + NYSE Pump. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 42 Bepe Baddies, this ranks #4. Top 10% of its own kind. You stumbled onto something real here, bro. Winners win! 🍊👑",
  "4163": "#31 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Plus you've got Bepe Suit - all S-tier providence. The pulp don't lie! Bepe Baddie + Bepe Suit. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2983": "Alright bro, #32 in the grove. That's top 50 - we're talking elite territory here. Here's what most people miss: NPC + Tiara. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 And we're talking #2 out of 250 Waifus. Top 3 of its kind. Elite status within the base. That Tiara adds solid value too. B-tier providence, but still above average. Born different, stays different. Winners win! 🍊👑",
  "3841": "Top 50 at rank #33. Let me break down why this Alien Waifu matters. Plus you've got Cyber Shades, Fedora - all S-tier providence. The pulp don't lie! But check this - Alien Waifu + Fedora together? Only ONE in existence. That's a true 1-of-1 combo right there. And we're talking #3 out of 35 Alien Waifus. Top 3 of its kind. Elite status within the base. That Vintage Dress adds solid value too. B-tier providence, but still above average. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "3706": "Alright Neckbeard, #34 in the grove. That's top 50 - we're talking elite territory here. Full Piccolo transformation achieved. Turban AND Uniform together. Only 7 in the entire grove pulled this off. Namekian royalty right here. Only 7 NFTs in the collection have this combo. Worth the squeeze. 🍊 Among all 100 Alien Wojaks, this ranks #7. Top 10% of its own kind. That Piccolo Turban adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4196": "#35 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Bepe Baddie + Rekt - only 2 NFTs share this combination. Less than 0.1% of the grove. The pulp is real with this one. Grove-certified. 🍊",
  "2742": "Top 50 at rank #36. Let me break down why this Soyjak matters. Plus you've got Cyber Shades, Super Saiyan Uniform - all S-tier providence. The pulp don't lie! Here's what most people miss: Rugged + Soy Hair. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 And we're talking #3 out of 750 Soyjaks. Top 3 of its kind. Elite status within the base. The grove blessed this one. Winners win! 🍊👑",
  "3723": "Alright TangTard, #37 in the grove. That's top 50 - we're talking elite territory here. But check this - Rugged + Piccolo Turban together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 100 Alien Wojaks, this ranks #8. Top 10% of its own kind. That Piccolo Turban adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2796": "Alright brother, #38 in the grove. That's top 50 - we're talking elite territory here. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! But check this - Sexy Lip Bite + Tangerine Pop together? Only ONE in existence. That's a true 1-of-1 combo right there. And we're talking #3 out of 250 Waifus. Top 3 of its kind. Elite status within the base. That Tiara adds solid value too. B-tier providence, but still above average. Born different, stays different. Winners win! 🍊👑",
  "3081": "Top 50 at rank #39. Let me break down why this Baddie matters. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! But check this - Alpha Shades + Twin Braids together? Only ONE in existence. That's a true 1-of-1 combo right there. And we're talking #2 out of 200 Baddies. Top 3 of its kind. Elite status within the base. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3787": "Top 50 at rank #40. Let me break down why this Alien Soyjak matters. But check this - Alien Soyjak + Rainforest together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #4 out of 80 Alien Soyjaks - top 5% of all Alien Soyjaks in the grove. That Propeller Hat adds solid value too. B-tier providence, but still above average. Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3892": "Top 50 at rank #41. Let me break down why this Alien Baddie matters. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. And we're talking #2 out of 35 Alien Baddies. Top 3 of its kind. Elite status within the base. Not everyone gets this lucky. Winners win! 🍊👑",
  "3856": "#42 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Vintage Dress adds solid value too. B-tier providence, but still above average. Most will never hold something like this. Winners win! 🍊👑",
  "4181": "#43 out of 4,200. Top 50. Not everyone makes it this far up, and for good reason. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Here's what most people miss: Bepe Baddie + Silicon Data Center. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Vintage Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3730": "Alright bro, #44 in the grove. That's top 50 - we're talking elite territory here. Smile + Piccolo Turban. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 100 Alien Wojaks, this ranks #9. Top 10% of its own kind. That Laser Eyes adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "3900": "Top 50 at rank #45. Let me break down why this Alien Baddie matters. Plus you've got Devil Horns - all S-tier providence. The pulp don't lie! Devil Horns in Hell where they belong. Some chose chaos. Chaos chose back. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #3 out of 35 Alien Baddies. Top 3 of its kind. Elite status within the base. The grove provides, and it provided well here. Winners win! 🍊👑",
  "3780": "Alright bro, #46 in the grove. That's top 50 - we're talking elite territory here. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Alien Soyjak + NYSE Rug. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 80 Alien Soyjaks, this ranks #5. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "3861": "Top 50 at rank #47. Let me break down why this Alien Waifu matters. Beanie + Sports Bra. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Beanie adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4193": "Alright bro, #48 in the grove. That's top 50 - we're talking elite territory here. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Bepe Baddie + Moon - only 3 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3702": "Top 50 at rank #49. Let me break down why this Alien Wojak matters. Spikes + Piccolo Uniform. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 100 Alien Wojaks, this ranks #10. Top 10% of its own kind. That Piccolo Uniform adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3842": "Top 50 at rank #50. Let me break down why this Alien Waifu matters. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Here's what most people miss: Smile + Mermaid Waves. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Prom Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3860": "#51. Top 100 status. When you're this high up, every trait starts to matter. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Here's what most people miss: Cap + Sports Bra. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Most will never hold something like this. Winners win! 🍊👑",
  "3083": "Top 100 at #52. This Baddie didn't stumble here by accident. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! Laser Eyes + Mermaid Waves. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! And we're talking #3 out of 200 Baddies. Top 3 of its kind. Elite status within the base. That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4190": "#53. Top 100 status. When you're this high up, every trait starts to matter. Bepe Baddie + Alpha Shades - only 2 NFTs share this combination. Less than 0.1% of the grove. That Suit adds solid value too. B-tier providence, but still above average. The pulp is real with this one. Grove-certified. 🍊",
  "3778": "#54. Top 100 status. When you're this high up, every trait starts to matter. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. Among all 80 Alien Soyjaks, this ranks #6. Top 10% of its own kind. That Drac adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4119": "#55. Top 100 status. When you're this high up, every trait starts to matter. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Bepe Waifu + Moon - only 2 NFTs share this combination. Less than 0.1% of the grove. Solid pulp all around. Grove-certified. 🍊",
  "3881": "Rank #56, Neckbeard. Top 100 puts this Alien Baddie in the top 2.4% of everything. Power Bob + Morning Routine. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2914": "Top 100 at #57. This Waifu didn't stumble here by accident. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! But check this - Pipe + Tiara together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #4 out of 250 Waifus - top 2% of all Waifus in the grove. That Tiara adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3076": "Top 100 at #58. This Baddie didn't stumble here by accident. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! But check this - Sexy Lip Bite + Pepe Suit together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #4 out of 200 Baddies - top 2% of all Baddies in the grove. Not everyone gets this lucky. Winners win! 🍊👑",
  "41": "Top 100 at #59. This Wojak didn't stumble here by accident. Plus you've got Wizard Glasses, Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 Oh and TangTard? This is the #1 Wojak in existence. The rarest Wojak out of all 1996. 👑 Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3796": "Rank #60, bro. Top 100 puts this Alien Soyjak in the top 2.4% of everything. Neckbeard trait - the culture, bro. Winners win! The entire providence system was built around this. Here's what most people miss: Trump Wave + Chia Farm. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 80 Alien Soyjaks, this ranks #7. Top 10% of its own kind. That Trump Wave adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3038": "#61. Top 100 status. When you're this high up, every trait starts to matter. But check this - Sexy Lip Bite + Mellow Yellow together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #5 out of 200 Baddies - top 2% of all Baddies in the grove. That Night Vision adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3927": "Rank #62, TangTard. Top 100 puts this Bepe Wojak in the top 2.4% of everything. Vampire Teeth in Mom's Basement. Hasn't seen sunlight in months. Still plotting. Still winning. Only 10 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #2 out of 124 Bepe Wojaks. Top 3 of its kind. Elite status within the base. That Drac adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3503": "#63. Top 100 status. When you're this high up, every trait starts to matter. Aviators + Headphones. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! And we're talking #2 out of 200 Monkey Zoos. Top 3 of its kind. Elite status within the base. That Chia Farmer adds solid value too. B-tier providence, but still above average. Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3890": "#64. Top 100 status. When you're this high up, every trait starts to matter. Plus you've got Wizard Glasses, Wizard Drip - all S-tier providence. The pulp don't lie! Wizard Drip + Wizard Glasses together - that's the Full Wizard combo. 148 total in the grove. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "3716": "Rank #65, brother. Top 100 puts this Alien Wojak in the top 2.4% of everything. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3722": "Rank #66, brother. Top 100 puts this Alien Wojak in the top 2.4% of everything. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. That Drac adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3718": "Top 100 at #67. This Alien Wojak didn't stumble here by accident. Heaven background with divine energy. This one ascended. The meme gods accepted another soul. That Construction Helmet adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4046": "#68. Top 100 status. When you're this high up, every trait starts to matter. Plus you've got Fedora, El Presidente - all S-tier providence. The pulp don't lie! Here's what most people miss: Bepe Soyjak + Fedora. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Oh and brother? This is the #1 Bepe Soyjak in existence. The rarest Bepe Soyjak out of all 96. 👑 That Laser Eyes adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "4185": "#69. Top 100 status. When you're this high up, every trait starts to matter. Bepe Baddie + Tiara - only 2 NFTs share this combination. Less than 0.1% of the grove. That Tiara adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "4138": "#70. Top 100 status. When you're this high up, every trait starts to matter. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Bepe Waifu + Bubble Gum - only 2 NFTs share this combination. Less than 0.1% of the grove. The pulp don't lie, TangTard. This one's worth the squeeze. 🍊",
  "3891": "Top 100 at #71. This Alien Baddie didn't stumble here by accident. Plus you've got Wizard Drip - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Laser Eyes adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3878": "#72. Top 100 status. When you're this high up, every trait starts to matter. Alien Baddie + Mermaid Waves - only 2 NFTs share this combination. Less than 0.1% of the grove. That Prom Dress adds solid value too. B-tier providence, but still above average. Top 420 means something. Not everyone makes this list. 🍊",
  "3785": "#73. Top 100 status. When you're this high up, every trait starts to matter. Plus you've got Wizard Drip - all S-tier providence. The pulp don't lie! Halo in Heaven. This one made it. Ascended to meme paradise. Among all 80 Alien Soyjaks, this ranks #8. Top 10% of its own kind. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3835": "Rank #74, bro. Top 100 puts this Alien Waifu in the top 2.4% of everything. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3080": "Rank #75, TangTard. Top 100 puts this Baddie in the top 2.4% of everything. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! Pizza mouth on $PIZZA background. Every day is pizza day for this one. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #6 out of 200 Baddies - top 3% of all Baddies in the grove. Solid pulp all around. Grove-certified. 🍊",
  "4153": "#76. Top 100 status. When you're this high up, every trait starts to matter. Bepe Waifu + Rekt - only 2 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Top 420 means something. Not everyone makes this list. 🍊",
  "4152": "Top 100 at #77. This Bepe Waifu didn't stumble here by accident. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Cohiba + Vintage Dress. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Vintage Dress adds solid value too. B-tier providence, but still above average. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "3692": "Top 100 at #78. This Alien Wojak didn't stumble here by accident. Plus you've got Fedora - all S-tier providence. The pulp don't lie! Pizza mouth on $PIZZA background. Every day is pizza day for this one. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3854": "#79. Top 100 status. When you're this high up, every trait starts to matter. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Vintage Dress adds solid value too. B-tier providence, but still above average. Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3855": "#80. Top 100 status. When you're this high up, every trait starts to matter. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Vintage Dress adds solid value too. B-tier providence, but still above average. Worth the squeeze, brother. 🍊",
  "3824": "Rank #81, bro. Top 100 puts this Alien Soyjak in the top 2.4% of everything. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Piccolo Uniform adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3767": "Rank #82, bro. Top 100 puts this Alien Soyjak in the top 2.4% of everything. Matrix Lenses in the Matrix. Red pill accepted. This one sees through the simulation. That Trump Wave adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4158": "Top 100 at #83. This Bepe Waifu didn't stumble here by accident. Plus you've got Wizard Hat - all S-tier providence. The pulp don't lie! Bepe Waifu + Alpha Shades. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "3849": "Top 100 at #84. This Alien Waifu didn't stumble here by accident. But check this - Alien Waifu + School Uniform together? Only ONE in existence. That's a true 1-of-1 combo right there. That School Uniform adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2868": "Rank #85, TangTard. Top 100 puts this Waifu in the top 2.4% of everything. Plus you've got Devil Horns - all S-tier providence. The pulp don't lie! But check this - Pizza + Prom Dress together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #5 out of 250 Waifus - top 2% of all Waifus in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3888": "#86. Top 100 status. When you're this high up, every trait starts to matter. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Beanie adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3688": "Rank #87, bro. Top 100 puts this Alien Wojak in the top 2.4% of everything. Everything's Fine background with Firefighter gear. When the market burns, this one responds. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2867": "#88. Top 100 status. When you're this high up, every trait starts to matter. First things first - that Crown. 👑 Most wanted trait in the entire collection. Royal Club status, bro. Winners win! Here's what most people miss: Terminator + $HONK. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #6 out of 250 Waifus - top 2% of all Waifus in the grove. That Prom Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "4051": "#89. Top 100 status. When you're this high up, every trait starts to matter. Halo in Heaven. This one made it. Ascended to meme paradise. And we're talking #2 out of 96 Bepe Soyjaks. Top 3 of its kind. Elite status within the base. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3721": "Rank #90, Neckbeard. Top 100 puts this Alien Wojak in the top 2.4% of everything. Plus you've got Wizard Glasses, Devil Horns - all S-tier providence. The pulp don't lie! Heaven background with divine energy. This one ascended. The meme gods accepted another soul. That Drac adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "46": "Top 100 at #91. This Wojak didn't stumble here by accident. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #2 out of 1996 Wojaks. Top 3 of its kind. Elite status within the base. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2916": "#92. Top 100 status. When you're this high up, every trait starts to matter. Waifu + Rainforest. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #7 out of 250 Waifus - top 3% of all Waifus in the grove. That Night Vision adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3672": "Top 100 at #93. This Alien Wojak didn't stumble here by accident. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3668": "Rank #94, brother. Top 100 puts this Alien Wojak in the top 2.4% of everything. Plus you've got Fake It Mask, Devil Horns - all S-tier providence. The pulp don't lie! Devil Horns in Hell where they belong. Some chose chaos. Chaos chose back. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4194": "Top 100 at #95. This Bepe Baddie didn't stumble here by accident. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Vixen Waves + Hell - only 2 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3458": "Top 100 at #96. This Monkey Zoo didn't stumble here by accident. Monkey Zoo + Cowboy Hat - only 3 NFTs share this combination. Less than 0.1% of the grove. And we're talking #3 out of 200 Monkey Zoos. Top 3 of its kind. Elite status within the base. That Laser Eyes adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "3862": "#97. Top 100 status. When you're this high up, every trait starts to matter. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Cowboy Hat + Leather Jacket together - that's the Route 66 Rider combo. 71 total in the grove. The grove blessed this one. Winners win! 🍊👑",
  "2789": "Rank #98, TangTard. Top 100 puts this Waifu in the top 2.4% of everything. But check this - Bleeding Bags + Power Bob together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #8 out of 250 Waifus - top 3% of all Waifus in the grove. The grove blessed this one. Winners win! 🍊👑",
  "4165": "Top 100 at #99. This Bepe Baddie didn't stumble here by accident. Here's what most people miss: Bepe Baddie + Chia Farmer. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Cool Glasses adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3844": "Top 100 at #100. This Alien Waifu didn't stumble here by accident. Military Beret equipped. You know the rules - the beret stays on. Always. Second most wanted trait in the grove. But check this - Alien Waifu + Copium Mask together? Only ONE in existence. That's a true 1-of-1 combo right there. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4064": "Rank #101. Top 200 means you're looking at something with real substance. Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. And we're talking #3 out of 96 Bepe Soyjaks. Top 3 of its kind. Elite status within the base. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3135": "Top 5% at #102. Let's talk about what makes this Baddie tick. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. This is #7 out of 200 Baddies - top 4% of all Baddies in the grove. That School Uniform adds solid value too. B-tier providence, but still above average. You stumbled onto something real here, bro. Winners win! 🍊👑",
  "4142": "Rank #103. Top 200 means you're looking at something with real substance. Bepe Waifu + One Market. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Tiara adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "3894": "Top 5% at #104. Let's talk about what makes this Alien Baddie tick. Here's what most people miss: Alien Baddie + Tiara. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Tiara adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3880": "#105 in the collection. Top 5%, TangTard. Solid positioning. Alien Baddie + Ponytail. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! The grove blessed this one. Winners win! 🍊👑",
  "3748": "Rank #106. Top 200 means you're looking at something with real substance. Halo in Heaven. This one made it. Ascended to meme paradise. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3797": "Top 5% at #107. Let's talk about what makes this Alien Soyjak tick. White House with Trump Wave. Running the free world, one meme at a time. Only 25 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Trump Wave adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3057": "#108 in the collection. Top 5%, bro. Solid positioning. Plus you've got Gopher Suit - all S-tier providence. The pulp don't lie! Pizza mouth on $PIZZA background. Every day is pizza day for this one. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #8 out of 200 Baddies - top 4% of all Baddies in the grove. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3026": "#109 in the collection. Top 5%, TangTard. Solid positioning. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! Pizza mouth on $PIZZA background. Every day is pizza day for this one. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #9 out of 200 Baddies - top 4% of all Baddies in the grove. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "2934": "Top 5% at #110. Let's talk about what makes this Waifu tick. But check this - Shades + Vixen Waves together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #9 out of 250 Waifus - top 4% of all Waifus in the grove. Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3535": "#111 in the collection. Top 5%, TangTard. Solid positioning. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Centurion helmet with Roman Drip. Ave, true to Caesar. The empire approves. This is #4 out of 200 Monkey Zoos - top 2% of all Monkey Zoos in the grove. The pulp don't lie, TangTard. This one's worth the squeeze. 🍊",
  "3570": "Rank #112. Top 200 means you're looking at something with real substance. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. MOG Glasses + Headphones. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #5 out of 200 Monkey Zoos - top 2% of all Monkey Zoos in the grove. Most will never hold something like this. Winners win! 🍊👑",
  "4179": "#113 in the collection. Top 5%, bro. Solid positioning. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Bepe Baddie + Teeth. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! When the traits align like this, you pay attention. Winners win! 🍊👑",
  "47": "Top 5% at #114. Let's talk about what makes this Wojak tick. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 And we're talking #3 out of 1996 Wojaks. Top 3 of its kind. Elite status within the base. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3786": "#115 in the collection. Top 5%, bro. Solid positioning. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Alien Soyjak + Copium Mask - only 2 NFTs share this combination. Less than 0.1% of the grove. That Suit adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "3082": "Rank #116. Top 200 means you're looking at something with real substance. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! Smile + Ponytail. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #10 out of 200 Baddies - top 5% of all Baddies in the grove. Born different, stays different. Winners win! 🍊👑",
  "4151": "Top 5% at #117. Let's talk about what makes this Bepe Waifu tick. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Joint + Vixen Waves - only 3 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "4140": "Rank #118. Top 200 means you're looking at something with real substance. Bepe Waifu + Silicon Data Center. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Vintage Dress adds solid value too. B-tier providence, but still above average. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "3589": "Top 5% at #119. Let's talk about what makes this Monkey Zoo tick. The Crown though. You know what that means? Citrus royalty. The community has spoken and this is THE trait everyone hunts for. Plus you've got Wizard Glasses - all S-tier providence. The pulp don't lie! But check this - Wizard Glasses + Rainforest together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #6 out of 200 Monkey Zoos - top 3% of all Monkey Zoos in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2912": "Rank #120. Top 200 means you're looking at something with real substance. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Pirate Hat on Pirate Ship. X marks the spot. This captain found the treasure. This is #10 out of 250 Waifus - top 4% of all Waifus in the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "2911": "#121 in the collection. Top 5%, brother. Solid positioning. Here's what most people miss: Hip Hop Hat + Morning Routine. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #11 out of 250 Waifus - top 4% of all Waifus in the grove. That School Uniform adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4184": "Top 5% at #122. Let's talk about what makes this Bepe Baddie tick. Here's what most people miss: Twin Braids + One Market. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Vintage Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3435": "#123 in the collection. Top 5%, TangTard. Solid positioning. Plus you've got VR Headset, Clown - all S-tier providence. The pulp don't lie! But check this - Gold Teeth + Rainforest together? Only ONE in existence. That's a true 1-of-1 combo right there. Oh and TangTard? This is the #1 Papa Tang in existence. The rarest Papa Tang out of all 250. 👑 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4188": "Top 5% at #124. Let's talk about what makes this Bepe Baddie tick. Matrix Lenses in the Matrix. Red pill accepted. This one sees through the simulation. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4088": "Top 5% at #125. Let's talk about what makes this Bepe Soyjak tick. Sonic Suit + Bepe Barracks. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #4 out of 96 Bepe Soyjaks - top 4% of all Bepe Soyjaks in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "4120": "Top 5% at #126. Let's talk about what makes this Bepe Waifu tick. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! But check this - Bepe Waifu + Pipe together? Only ONE in existence. That's a true 1-of-1 combo right there. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3521": "#127 in the collection. Top 5%, bro. Solid positioning. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Pizza + 2Pac Bandana - only 2 NFTs share this combination. Less than 0.1% of the grove. This is #7 out of 200 Monkey Zoos - top 4% of all Monkey Zoos in the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. The pulp don't lie, bro. This one's worth the squeeze. 🍊",
  "2984": "#128 in the collection. Top 5%, bro. Solid positioning. First things first - that Crown. 👑 Most wanted trait in the entire collection. Royal Club status, bro. Winners win! But check this - Teeth + Vintage Dress together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #12 out of 250 Waifus - top 5% of all Waifus in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Born different, stays different. Winners win! 🍊👑",
  "4131": "Top 5% at #129. Let's talk about what makes this Bepe Waifu tick. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! Bepe Waifu + Goose Suit. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3980": "#130 in the collection. Top 5%, TangTard. Solid positioning. SWAT Helmet + SWAT Gear together - that's the Full SWAT combo. 26 total in the grove. And we're talking #3 out of 124 Bepe Wojaks. Top 3 of its kind. Elite status within the base. That Laser Eyes adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3140": "Rank #131. Top 200 means you're looking at something with real substance. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. MOG Glasses + Tiara - only 2 NFTs share this combination. Less than 0.1% of the grove. Among all 200 Baddies, this ranks #11. Top 10% of its own kind. That Tiara adds solid value too. B-tier providence, but still above average. The pulp don't lie, Neckbeard. This one's worth the squeeze. 🍊",
  "3632": "Rank #132. Top 200 means you're looking at something with real substance. Pipe + $PIZZA. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #8 out of 200 Monkey Zoos - top 4% of all Monkey Zoos in the grove. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3179": "#133 in the collection. Top 5%, brother. Solid positioning. Plus you've got Wizard Glasses - all S-tier providence. The pulp don't lie! Here's what most people miss: Sexy Lip Bite + Wizard Glasses. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 200 Baddies, this ranks #12. Top 10% of its own kind. That Vintage Dress adds solid value too. B-tier providence, but still above average. This one was destined to stand out. Winners win! 🍊👑",
  "3782": "Top 5% at #134. Let's talk about what makes this Alien Soyjak tick. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Here's what most people miss: Alien Soyjak + $HOA. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Eye Patch adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3877": "Rank #135. Top 200 means you're looking at something with real substance. That Beret. The beret stays on, Neckbeard. Non-negotiable. S-tier providence right there. But check this - Alien Baddie + Aviators together? Only ONE in existence. That's a true 1-of-1 combo right there. That SWAT Gear adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2090": "Top 5% at #136. Let's talk about what makes this Soyjak tick. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Bathrobe + Morning Routine together - that's the Morning Routine combo. 21 total in the grove. This is #4 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. The grove provides, and it provided well here. Winners win! 🍊👑",
  "4157": "Top 5% at #137. Let's talk about what makes this Bepe Waifu tick. Bepe Waifu + $LOVE - only 2 NFTs share this combination. Less than 0.1% of the grove. That Tiara adds solid value too. B-tier providence, but still above average. The pulp is real with this one. Grove-certified. 🍊",
  "4199": "Rank #138. Top 200 means you're looking at something with real substance. Bepe Baddie + Tiara - only 2 NFTs share this combination. Less than 0.1% of the grove. That Tiara adds solid value too. B-tier providence, but still above average. Top 420 means something. Not everyone makes this list. 🍊",
  "2866": "Top 5% at #139. Let's talk about what makes this Waifu tick. Plus you've got Ronin Helmet - all S-tier providence. The pulp don't lie! Here's what most people miss: Ronin Helmet + Prom Dress. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 250 Waifus, this ranks #13. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3908": "Top 5% at #140. Let's talk about what makes this Bepe Wojak tick. Crown holder right here. 👑 This isn't just S-tier providence, this is the S-tier. Royal Club. Winners win! Here's what most people miss: Vampire Teeth + Bathrobe. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #4 out of 124 Bepe Wojaks - top 3% of all Bepe Wojaks in the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3954": "Top 5% at #141. Let's talk about what makes this Bepe Wojak tick. Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. This is #5 out of 124 Bepe Wojaks - top 4% of all Bepe Wojaks in the grove. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4115": "Rank #142. Top 200 means you're looking at something with real substance. Plus you've got Wizard Hat, Wizard Drip - all S-tier providence. The pulp don't lie! Wizard Hat + Wizard Drip together - that's the Full Wizard combo. 148 total in the grove. Among all 96 Bepe Soyjaks, this ranks #5. Top 10% of its own kind. That Night Vision adds solid value too. B-tier providence, but still above average. The grove provides, and it provided well here. Winners win! 🍊👑",
  "3911": "Top 5% at #143. Let's talk about what makes this Bepe Wojak tick. Plus you've got Clown Nose, Bepe Army - all S-tier providence. The pulp don't lie! Bepe Wojak + Rainforest. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #6 out of 124 Bepe Wojaks - top 5% of all Bepe Wojaks in the grove. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2517": "Top 5% at #144. Let's talk about what makes this Soyjak tick. Price Up + Smile together - that's the Price Pump combo. 5 total in the grove. This is #5 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. That Night Vision adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "4077": "Rank #145. Top 200 means you're looking at something with real substance. Neckbeard trait - the culture, bro. Winners win! The entire providence system was built around this. Rome + Roman Drip together - that's the Roman Empire combo. 85 total in the grove. Among all 96 Bepe Soyjaks, this ranks #6. Top 10% of its own kind. That Night Vision adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2457": "#146 in the collection. Top 5%, brother. Solid positioning. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #6 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3955": "Top 5% at #147. Let's talk about what makes this Bepe Wojak tick. Plus you've got Fedora - all S-tier providence. The pulp don't lie! Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. Among all 124 Bepe Wojaks, this ranks #7. Top 10% of its own kind. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "3086": "#148 in the collection. Top 5%, bro. Solid positioning. Plus you've got Cyber Shades, Wizard Hat - all S-tier providence. The pulp don't lie! Cyber Shades + Prom Dress. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 200 Baddies, this ranks #13. Top 10% of its own kind. That Prom Dress adds solid value too. B-tier providence, but still above average. Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3098": "Top 5% at #149. Let's talk about what makes this Baddie tick. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. But check this - Ponytail + Proof of Prayer together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 200 Baddies, this ranks #14. Top 10% of its own kind. That Proof of Prayer adds solid value too. B-tier providence, but still above average. Some NFTs are born different. This is one of them. Winners win! 🍊👑",
  "3777": "Top 5% at #150. Let's talk about what makes this Alien Soyjak tick. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. That Drac adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3132": "Rank #151. Top 200 means you're looking at something with real substance. Here's what most people miss: Baddie + Golden Hour. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 200 Baddies, this ranks #15. Top 10% of its own kind. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3701": "#152 in the collection. Top 5%, TangTard. Solid positioning. Plus you've got Ronin Helmet, Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This one was destined to stand out. Winners win! 🍊👑",
  "3931": "Rank #153. Top 200 means you're looking at something with real substance. Plus you've got VR Headset, El Presidente - all S-tier providence. The pulp don't lie! Bepe Wojak + Cowboy Hat. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 124 Bepe Wojaks, this ranks #8. Top 10% of its own kind. Most will never hold something like this. Winners win! 🍊👑",
  "3064": "Rank #154. Top 200 means you're looking at something with real substance. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! But check this - Joint + Tiara together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 200 Baddies, this ranks #16. Top 10% of its own kind. That Tiara adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2877": "Top 5% at #155. Let's talk about what makes this Waifu tick. Rome + Roman Drip together - that's the Roman Empire combo. 85 total in the grove. Among all 250 Waifus, this ranks #14. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3741": "Rank #156. Top 200 means you're looking at something with real substance. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Plus you've got El Presidente - all S-tier providence. The pulp don't lie! But check this - 3D Glasses + El Presidente together? Only ONE in existence. That's a true 1-of-1 combo right there. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "4180": "#157 in the collection. Top 5%, brother. Solid positioning. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! But check this - Bepe Baddie + 3D Glasses together? Only ONE in existence. That's a true 1-of-1 combo right there. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4198": "#158 in the collection. Top 5%, Neckbeard. Solid positioning. Bepe Baddie + $LOVE - only 2 NFTs share this combination. Less than 0.1% of the grove. Top 420 means something. Not everyone makes this list. 🍊",
  "3958": "Top 5% at #159. Let's talk about what makes this Bepe Wojak tick. Plus you've got VR Headset, Pepe Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: VR Headset + NYSE Pump. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 124 Bepe Wojaks, this ranks #9. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3363": "Top 5% at #160. Let's talk about what makes this Papa Tang tick. Plus you've got Super Saiyan Uniform - all S-tier providence. The pulp don't lie! Everything's Fine background with Firefighter gear. When the market burns, this one responds. And we're talking #2 out of 250 Papa Tangs. Top 3 of its kind. Elite status within the base. That Night Vision adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3846": "Rank #161. Top 200 means you're looking at something with real substance. But check this - Alien Waifu + Night Vision together? Only ONE in existence. That's a true 1-of-1 combo right there. That Night Vision adds solid value too. B-tier providence, but still above average. You're holding something special and I need you to understand that. Winners win! 🍊👑",
  "3242": "Rank #162. Top 200 means you're looking at something with real substance. Plus you've got VR Headset, Beer Hat - all S-tier providence. The pulp don't lie! Route 66 + Born to Ride together - that's the Route 66 Rider combo. 71 total in the grove. And we're talking #3 out of 250 Papa Tangs. Top 3 of its kind. Elite status within the base. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3520": "#163 in the collection. Top 5%, bro. Solid positioning. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! White House with Trump Wave. Running the free world, one meme at a time. Only 25 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #9 out of 200 Monkey Zoos - top 4% of all Monkey Zoos in the grove. Good traits, good position, good energy. Grove-certified. 🍊",
  "3882": "Rank #164. Top 200 means you're looking at something with real substance. But check this - Alien Baddie + Twin Braids together? Only ONE in existence. That's a true 1-of-1 combo right there. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4176": "Rank #165. Top 200 means you're looking at something with real substance. Bepe Baddie + Laser Eyes. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Laser Eyes adds solid value too. B-tier providence, but still above average. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "3832": "#166 in the collection. Top 5%, Neckbeard. Solid positioning. Plus you've got Beer Hat - all S-tier providence. The pulp don't lie! Here's what most people miss: Alien Waifu + Bandana Mask. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4197": "#167 in the collection. Top 5%, Neckbeard. Solid positioning. Bepe Baddie + Denim Vest - only 3 NFTs share this combination. Less than 0.1% of the grove. Top 420 means something. Not everyone makes this list. 🍊",
  "1392": "Rank #168. Top 200 means you're looking at something with real substance. Plus you've got Fake It Mask, Leather Jacket - all S-tier providence. The pulp don't lie! Here's what most people miss: Copium Mask + Fake It Mask. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #4 out of 1996 Wojaks - top 0% of all Wojaks in the grove. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3876": "Rank #169. Top 200 means you're looking at something with real substance. Alien Baddie + Halo. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Vintage Dress adds solid value too. B-tier providence, but still above average. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "3104": "Rank #170. Top 200 means you're looking at something with real substance. Centurion helmet with Roman Drip. Ave, true to Caesar. The empire approves. Among all 200 Baddies, this ranks #17. Top 10% of its own kind. That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2856": "Top 5% at #171. Let's talk about what makes this Waifu tick. Teeth + Prom Dress. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 250 Waifus, this ranks #15. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "4195": "#172 in the collection. Top 5%, Neckbeard. Solid positioning. Vixen Waves + Heaven. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Vintage Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3099": "#173 in the collection. Top 5%, TangTard. Solid positioning. Here's what most people miss: Power Bob + Proof of Prayer. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 200 Baddies, this ranks #18. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4048": "#174 in the collection. Top 5%, Neckbeard. Solid positioning. Everything's Fine background with Firefighter gear. When the market burns, this one responds. Among all 96 Bepe Soyjaks, this ranks #7. Top 10% of its own kind. The pulp is real with this one. Grove-certified. 🍊",
  "4042": "Top 5% at #175. Let's talk about what makes this Bepe Soyjak tick. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Here's what most people miss: Drac + Bepe Barracks. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 96 Bepe Soyjaks, this ranks #8. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2918": "Rank #176. Top 200 means you're looking at something with real substance. Halo in Heaven. This one made it. Ascended to meme paradise. Among all 250 Waifus, this ranks #16. Top 10% of its own kind. That School Uniform adds solid value too. B-tier providence, but still above average. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "2861": "Rank #177. Top 200 means you're looking at something with real substance. Plus you've got Fedora - all S-tier providence. The pulp don't lie! But check this - 3D Glasses + Prom Dress together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 250 Waifus, this ranks #17. Top 10% of its own kind. That Prom Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3825": "#178 in the collection. Top 5%, Neckbeard. Solid positioning. The Crown though. You know what that means? Citrus royalty. The community has spoken and this is THE trait everyone hunts for. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Piccolo Uniform adds solid value too. B-tier providence, but still above average. The grove provides, and it provided well here. Winners win! 🍊👑",
  "3052": "#179 in the collection. Top 5%, TangTard. Solid positioning. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Cool Glasses + Vixen Waves. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 200 Baddies, this ranks #19. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. You're holding something special and I need you to understand that. Winners win! 🍊👑",
  "3783": "Rank #180. Top 200 means you're looking at something with real substance. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Ninja Turtle Fit adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "4178": "Top 5% at #181. Let's talk about what makes this Bepe Baddie tick. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! But check this - Bepe Baddie + Pepe Suit together? Only ONE in existence. That's a true 1-of-1 combo right there. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3645": "Rank #182. Top 200 means you're looking at something with real substance. Here's what most people miss: Firefighter Helmet + Rainforest. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #10 out of 200 Monkey Zoos - top 5% of all Monkey Zoos in the grove. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "49": "Rank #183. Top 200 means you're looking at something with real substance. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #5 out of 1996 Wojaks - top 0% of all Wojaks in the grove. Most will never hold something like this. Winners win! 🍊👑",
  "3658": "Top 5% at #184. Let's talk about what makes this Alien Wojak tick. Neckbeard trait - the culture, Neckbeard. Winners win! The entire providence system was built around this. Neckbeard on $NECKCOIN. The official currency of winners. This is culture. Only 17 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Laser Eyes adds solid value too. B-tier providence, but still above average. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "3773": "#185 in the collection. Top 5%, Neckbeard. Solid positioning. Plus you've got Wizard Glasses, Bepe Suit - all S-tier providence. The pulp don't lie! Alien Soyjak + Wizard Glasses - only 2 NFTs share this combination. Less than 0.1% of the grove. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "3776": "Rank #186. Top 200 means you're looking at something with real substance. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. That Chia Farmer adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3088": "Rank #187. Top 200 means you're looking at something with real substance. Baddie + $HONK. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Among all 200 Baddies, this ranks #20. Top 10% of its own kind. That Prom Dress adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "3974": "Rank #188. Top 200 means you're looking at something with real substance. Plus you've got Wizard Glasses, Ronin - all S-tier providence. The pulp don't lie! Full Ronin loadout - helmet, robes, and dojo. The masterless warrior found his path. Among all 124 Bepe Wojaks, this ranks #10. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3517": "Top 5% at #189. Let's talk about what makes this Monkey Zoo tick. Plus you've got Wizard Glasses, Leather Jacket - all S-tier providence. The pulp don't lie! Everything's Fine background with Firefighter gear. When the market burns, this one responds. Among all 200 Monkey Zoos, this ranks #11. Top 10% of its own kind. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4156": "#190 in the collection. Top 5%, brother. Solid positioning. Bepe Waifu + Sky Shock Blue. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Tiara adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "3719": "Top 5% at #191. Let's talk about what makes this Alien Wojak tick. But check this - Bandana Mask + Piccolo Uniform together? Only ONE in existence. That's a true 1-of-1 combo right there. That Piccolo Uniform adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "2854": "Top 5% at #192. Let's talk about what makes this Waifu tick. Here's what most people miss: Sexy Lip Bite + Vixen Waves. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 250 Waifus, this ranks #18. Top 10% of its own kind. That Prom Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3039": "#193 in the collection. Top 5%, brother. Solid positioning. But check this - Denim Vest + $LOVE together? Only ONE in existence. That's a true 1-of-1 combo right there. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3698": "Top 5% at #194. Let's talk about what makes this Alien Wojak tick. Plus you've got Ronin - all S-tier providence. The pulp don't lie! Alien Wojak + Ronin - only 2 NFTs share this combination. Less than 0.1% of the grove. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. The pulp don't lie, Neckbeard. This one's worth the squeeze. 🍊",
  "3639": "Rank #195. Top 200 means you're looking at something with real substance. But check this - Headphones + Nesting Grounds together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 200 Monkey Zoos, this ranks #12. Top 10% of its own kind. Not everyone gets this lucky. Winners win! 🍊👑",
  "3040": "#196 in the collection. Top 5%, TangTard. Solid positioning. NPC + Ponytail. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4141": "Top 5% at #197. Let's talk about what makes this Bepe Waifu tick. Twin Braids + Orange Grove - only 3 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Top 420 means something. Not everyone makes this list. 🍊",
  "4192": "#198 in the collection. Top 5%, Neckbeard. Solid positioning. Bepe Baddie + Power Bob - only 2 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Worth the squeeze, Neckbeard. 🍊",
  "3699": "#199 in the collection. Top 5%, brother. Solid positioning. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! Alien Wojak + VR Headset - only 2 NFTs share this combination. Less than 0.1% of the grove. That Sonic Suit adds solid value too. B-tier providence, but still above average. The pulp don't lie, brother. This one's worth the squeeze. 🍊",
  "3781": "Rank #200. Top 200 means you're looking at something with real substance. Plus you've got Cyber Shades, Gopher Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Gopher Suit + NYSE Pump. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "45": "#201 out of 4,200. Top 10% of the grove. This Wojak made the cut. Plus you've got Fedora, Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #6 out of 1996 Wojaks - top 0% of all Wojaks in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3513": "#202 out of 4,200. Top 10% of the grove. This Monkey Zoo made the cut. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! But check this - Tyson Tattoo + $BEPE together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 200 Monkey Zoos, this ranks #13. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "109": "Rank #203. Not the top of the mountain, but definitely climbing. Let me show you why. Everything's Fine background with Firefighter gear. When the market burns, this one responds. This is #7 out of 1996 Wojaks - top 0% of all Wojaks in the grove. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3141": "Rank #204. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Wizard Glasses - all S-tier providence. The pulp don't lie! Halo in Heaven. This one made it. Ascended to meme paradise. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2972": "#205 out of 4,200. Top 10% of the grove. This Waifu made the cut. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. Among all 250 Waifus, this ranks #19. Top 10% of its own kind. That Vintage Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3961": "Rank #206. Not the top of the mountain, but definitely climbing. Let me show you why. Military Beret equipped. You know the rules - the beret stays on. Always. Second most wanted trait in the grove. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! The Bepe Wojak + Eye Patch pairing shows up in only 4 NFTs. Rare combination energy. Among all 124 Bepe Wojaks, this ranks #11. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3034": "Rank #207. Not the top of the mountain, but definitely climbing. Let me show you why. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Here's what most people miss: Tiara + Radioactive Forest. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Tiara adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "4127": "Rank #208. Not the top of the mountain, but definitely climbing. Let me show you why. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. But check this - Bepe Waifu + Smile together? Only ONE in existence. That's a true 1-of-1 combo right there. That Construction Helmet adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3991": "Rank #209. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Tin Foil Hat, Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 Among all 124 Bepe Wojaks, this ranks #12. Top 10% of its own kind. The grove provides, and it provided well here. Winners win! 🍊👑",
  "3150": "Top 420 at #210. Being in the top 10% means something. Let's break it down. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! Here's what most people miss: Tin Foil Hat + Sports Bra. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Laser Eyes adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4049": "Top 420 at #211. Being in the top 10% means something. Let's break it down. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! Bepe Soyjak + Tin Foil Hat - only 2 NFTs share this combination. Less than 0.1% of the grove. Among all 96 Bepe Soyjaks, this ranks #9. Top 10% of its own kind. Good traits, good position, good energy. Grove-certified. 🍊",
  "3752": "Rank #212. Not the top of the mountain, but definitely climbing. Let me show you why. Crown holder right here. 👑 This isn't just S-tier providence, this is the S-tier. Royal Club. Winners win! Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Alien Soyjak + Copium Mask - only 2 NFTs share this combination. Less than 0.1% of the grove. That Ninja Turtle Fit adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3869": "Rank #213. Not the top of the mountain, but definitely climbing. Let me show you why. Here's what most people miss: Alien Baddie + Joint. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3518": "Rank #214. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Cyber Shades, Leather Jacket - all S-tier providence. The pulp don't lie! Route 66 + Leather Jacket together - that's the Route 66 Rider combo. 71 total in the grove. Among all 200 Monkey Zoos, this ranks #14. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4182": "#215 out of 4,200. Top 10% of the grove. This Bepe Baddie made the cut. Bepe Baddie + Ponytail - only 3 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Worth the squeeze, brother. 🍊",
  "3795": "Rank #216. Not the top of the mountain, but definitely climbing. Let me show you why. That Neckbeard though. You're part of the culture now. Winners win, and Neckbeards win most. Plus you've got Super Saiyan - all S-tier providence. The pulp don't lie! Super Saiyan + SWAT Gear - only 3 NFTs share this combination. Less than 0.1% of the grove. That SWAT Gear adds solid value too. B-tier providence, but still above average. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "381": "Top 420 at #217. Being in the top 10% means something. Let's break it down. Plus you've got Fake It Mask, Tin Foil Hat - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #8 out of 1996 Wojaks - top 0% of all Wojaks in the grove. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "2572": "#218 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #7 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3960": "Rank #219. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Eye Patch + Pepe Suit. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4007": "Top 420 at #220. Being in the top 10% means something. Let's break it down. That Neckbeard though. You're part of the culture now. Winners win, and Neckbeards win most. Plus you've got Beer Hat - all S-tier providence. The pulp don't lie! Here's what most people miss: Bepe Wojak + Beer Hat. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Night Vision adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "609": "Rank #221. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Fedora - all S-tier providence. The pulp don't lie! Vampire Teeth + Morning Routine. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #9 out of 1996 Wojaks - top 0% of all Wojaks in the grove. That Drac adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3677": "#222 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. But check this - Pizza + Moms Basement together? Only ONE in existence. That's a true 1-of-1 combo right there. That Trump Wave adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "4092": "#223 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. Plus you've got Tin Foil Hat, Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4177": "Top 420 at #224. Being in the top 10% means something. Let's break it down. But check this - Bepe Baddie + Ninja Turtle Fit together? Only ONE in existence. That's a true 1-of-1 combo right there. That Cool Glasses adds solid value too. B-tier providence, but still above average. Born different, stays different. Winners win! 🍊👑",
  "3041": "Top 420 at #225. Being in the top 10% means something. Let's break it down. Plus you've got Wizard Glasses, Wizard Hat - all S-tier providence. The pulp don't lie! Spell Room + Wizard Hat + Wizard Glasses together - that's the Full Wizard combo. 148 total in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3852": "#226 out of 4,200. Top 10% of the grove. This Alien Waifu made the cut. Plus you've got Ronin Helmet, Ronin - all S-tier providence. The pulp don't lie! Full Ronin loadout - helmet, robes, and dojo. The masterless warrior found his path. That Eye Patch adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2161": "Rank #227. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #8 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4043": "#228 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. That Drac adds solid value too. B-tier providence, but still above average. The grove provides, and it provided well here. Winners win! 🍊👑",
  "3042": "#229 out of 4,200. Top 10% of the grove. This Baddie made the cut. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4106": "Rank #230. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Wizard Glasses - all S-tier providence. The pulp don't lie! Here's what most people miss: Bepe Soyjak + $PIZZA. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Trump Wave adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "3940": "#231 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. The Crown though. You know what that means? Citrus royalty. The community has spoken and this is THE trait everyone hunts for. Night Vision + God's Robe - only 2 NFTs share this combination. Less than 0.1% of the grove. That Night Vision adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3712": "#232 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! But check this - Laser Eyes + Beanie together? Only ONE in existence. That's a true 1-of-1 combo right there. That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2915": "Top 420 at #233. Being in the top 10% means something. Let's break it down. First things first - that Crown. 👑 Most wanted trait in the entire collection. Royal Club status, TangTard. Winners win! Here's what most people miss: Sexy Lip Bite + Cool Glasses. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 250 Waifus, this ranks #20. Top 10% of its own kind. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3724": "Rank #234. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Hannibal Mask adds solid value too. B-tier providence, but still above average. The pulp don't lie, brother. This one's worth the squeeze. 🍊",
  "2087": "Top 420 at #235. Being in the top 10% means something. Let's break it down. Standard Cut + Bathrobe. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #9 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. You stumbled onto something real here, bro. Winners win! 🍊👑",
  "3516": "Rank #236. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. Among all 200 Monkey Zoos, this ranks #15. Top 10% of its own kind. That Night Vision adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "3757": "#237 out of 4,200. Top 10% of the grove. This Alien Soyjak made the cut. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! Centurion helmet with Roman Drip. Ave, true to Caesar. The empire approves. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3932": "Top 420 at #238. Being in the top 10% means something. Let's break it down. Plus you've got El Presidente - all S-tier providence. The pulp don't lie! White House with Trump Wave. Running the free world, one meme at a time. Only 25 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Trump Wave adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3470": "Rank #239. Not the top of the mountain, but definitely climbing. Let me show you why. Military Beret equipped. You know the rules - the beret stays on. Always. Second most wanted trait in the grove. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! But check this - Pizza + Rainforest together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 200 Monkey Zoos, this ranks #16. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3896": "#240 out of 4,200. Top 10% of the grove. This Alien Baddie made the cut. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Propeller Hat adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3803": "Rank #241. Not the top of the mountain, but definitely climbing. Let me show you why. Everything's Fine background with Firefighter gear. When the market burns, this one responds. That Laser Eyes adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "3656": "Top 420 at #242. Being in the top 10% means something. Let's break it down. Plus you've got Fedora - all S-tier providence. The pulp don't lie! Here's what most people miss: Hannibal Mask + Chia Farm. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Hannibal Mask adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2982": "Rank #243. Not the top of the mountain, but definitely climbing. Let me show you why. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. Among all 250 Waifus, this ranks #21. Top 10% of its own kind. That Vintage Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2754": "Rank #244. Not the top of the mountain, but definitely climbing. Let me show you why. Bathrobe + Morning Routine together - that's the Morning Routine combo. 21 total in the grove. Among all 250 Waifus, this ranks #22. Top 10% of its own kind. That Tiara adds solid value too. B-tier providence, but still above average. This one was destined to stand out. Winners win! 🍊👑",
  "2955": "Rank #245. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! Here's what most people miss: Glossed Lips + VR Headset. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 250 Waifus, this ranks #23. Top 10% of its own kind. That Suit adds solid value too. B-tier providence, but still above average. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "2013": "#246 out of 4,200. Top 10% of the grove. This Soyjak made the cut. But check this - Astronaut + $HONK together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #10 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. That Astronaut adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3074": "#247 out of 4,200. Top 10% of the grove. This Baddie made the cut. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! Alpha Shades + Ponytail. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2478": "Rank #248. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! VR Headset + Soy Hair. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #11 out of 750 Soyjaks - top 1% of all Soyjaks in the grove. That Ninja Turtle Fit adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4144": "Top 420 at #249. Being in the top 10% means something. Let's break it down. Here's what most people miss: School Uniform + Moms Basement. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Propeller Hat adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "3100": "#250 out of 4,200. Top 10% of the grove. This Baddie made the cut. Terminator + Twin Braids - only 2 NFTs share this combination. Less than 0.1% of the grove. That Proof of Prayer adds solid value too. B-tier providence, but still above average. Worth the squeeze, brother. 🍊",
  "3298": "#251 out of 4,200. Top 10% of the grove. This Papa Tang made the cut. Plus you've got Ronin - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #4 out of 250 Papa Tangs - top 2% of all Papa Tangs in the grove. The pulp don't lie, brother. This one's worth the squeeze. 🍊",
  "48": "Top 420 at #252. Being in the top 10% means something. Let's break it down. Plus you've got Wizard Glasses, Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #10 out of 1996 Wojaks - top 1% of all Wojaks in the grove. Not everyone gets this lucky. Winners win! 🍊👑",
  "3213": "Top 420 at #253. Being in the top 10% means something. Let's break it down. Plus you've got Super Saiyan, Bepe Army - all S-tier providence. The pulp don't lie! But check this - Cool Glasses + Rainforest together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #5 out of 250 Papa Tangs - top 2% of all Papa Tangs in the grove. That Cool Glasses adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3171": "Rank #254. Not the top of the mountain, but definitely climbing. Let me show you why. Viking Armor + Moms Basement. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2420": "Rank #255. Not the top of the mountain, but definitely climbing. Let me show you why. Gold Teeth + Soy Hair. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #12 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "4183": "Rank #256. Not the top of the mountain, but definitely climbing. Let me show you why. The Vixen Waves + Orange Grove pairing shows up in only 5 NFTs. Rare combination energy. That Vintage Dress adds solid value too. B-tier providence, but still above average. Worth the squeeze, brother. 🍊",
  "3976": "Top 420 at #257. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades, Ronin Helmet - all S-tier providence. The pulp don't lie! Full Ronin loadout - helmet, robes, and dojo. The masterless warrior found his path. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3659": "Rank #258. Not the top of the mountain, but definitely climbing. Let me show you why. Neckbeard trait - the culture, Neckbeard. Winners win! The entire providence system was built around this. Matrix Lenses in the Matrix. Red pill accepted. This one sees through the simulation. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3883": "Rank #259. Not the top of the mountain, but definitely climbing. Let me show you why. Alien Baddie + Vixen Waves - only 2 NFTs share this combination. Less than 0.1% of the grove. The pulp is real with this one. Grove-certified. 🍊",
  "2898": "Top 420 at #260. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Pizza mouth on $PIZZA background. Every day is pizza day for this one. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 Among all 250 Waifus, this ranks #24. Top 10% of its own kind. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3492": "Top 420 at #261. Being in the top 10% means something. Let's break it down. Here's what most people miss: Bubble Gum + 2Pac Bandana. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 200 Monkey Zoos, this ranks #17. Top 10% of its own kind. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "2766": "#262 out of 4,200. Top 10% of the grove. This Waifu made the cut. Here's what most people miss: Power Bob + Born to Ride. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Among all 250 Waifus, this ranks #25. Top 10% of its own kind. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. The grove provides, and it provided well here. Winners win! 🍊👑",
  "3439": "#263 out of 4,200. Top 10% of the grove. This Papa Tang made the cut. Viking Helmet plus Viking Armor. Valhalla awaits. The raiders came correct. This is #6 out of 250 Papa Tangs - top 2% of all Papa Tangs in the grove. Solid pulp all around. Grove-certified. 🍊",
  "3209": "Top 420 at #264. Being in the top 10% means something. Let's break it down. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Plus you've got Fedora - all S-tier providence. The pulp don't lie! Bathrobe + Morning Routine together - that's the Morning Routine combo. 21 total in the grove. This is #7 out of 250 Papa Tangs - top 3% of all Papa Tangs in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3635": "#265 out of 4,200. Top 10% of the grove. This Monkey Zoo made the cut. Screaming + $NECKCOIN - only 2 NFTs share this combination. Less than 0.1% of the grove. Among all 200 Monkey Zoos, this ranks #18. Top 10% of its own kind. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3744": "Top 420 at #266. Being in the top 10% means something. Let's break it down. Alien Soyjak + Cap - only 2 NFTs share this combination. Less than 0.1% of the grove. That Cool Glasses adds solid value too. B-tier providence, but still above average. Top 420 means something. Not everyone makes this list. 🍊",
  "722": "Rank #267. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Everything's Fine background with Firefighter gear. When the market burns, this one responds. This is #11 out of 1996 Wojaks - top 1% of all Wojaks in the grove. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3948": "Rank #268. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Gopher Suit - all S-tier providence. The pulp don't lie! Stache + Gopher Suit - only 2 NFTs share this combination. Less than 0.1% of the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "2678": "Rank #269. Not the top of the mountain, but definitely climbing. Let me show you why. But check this - Chia Farmer + NYSE Dump together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #13 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. That Chia Farmer adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3851": "Top 420 at #270. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Alien Waifu + Suit. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Suit adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "2363": "Rank #271. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Pirate Hat on Pirate Ship. X marks the spot. This captain found the treasure. This is #14 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. Born different, stays different. Winners win! 🍊👑",
  "3798": "Top 420 at #272. Being in the top 10% means something. Let's break it down. Silicon Data Center + Terminator together - that's the Chia Tech combo. 32 total in the grove. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "3515": "Rank #273. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Rome + Centurion together - that's the Roman Empire combo. 85 total in the grove. Among all 200 Monkey Zoos, this ranks #19. Top 10% of its own kind. Solid pulp all around. Grove-certified. 🍊",
  "1975": "Rank #274. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Fake It Mask, Clown - all S-tier providence. The pulp don't lie! Here's what most people miss: Clown + Signal Lost. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #12 out of 1996 Wojaks - top 1% of all Wojaks in the grove. That Suit adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3445": "#275 out of 4,200. Top 10% of the grove. This Papa Tang made the cut. But check this - Matrix Lenses + $NECKCOIN together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #8 out of 250 Papa Tangs - top 3% of all Papa Tangs in the grove. That Propeller Hat adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4052": "#276 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. That Neckbeard though. You're part of the culture now. Winners win, and Neckbeards win most. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Halo in Heaven. This one made it. Ascended to meme paradise. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4080": "Rank #277. Not the top of the mountain, but definitely climbing. Let me show you why. That Neckbeard though. You're part of the culture now. Winners win, and Neckbeards win most. Plus you've got Cyber Shades, Ronin Helmet - all S-tier providence. The pulp don't lie! Full Ronin loadout - helmet, robes, and dojo. The masterless warrior found his path. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3815": "Rank #278. Not the top of the mountain, but definitely climbing. Let me show you why. That Beret. The beret stays on, bro. Non-negotiable. S-tier providence right there. Plus you've got El Presidente - all S-tier providence. The pulp don't lie! Bubble Gum + El Presidente - only 2 NFTs share this combination. Less than 0.1% of the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4107": "Rank #279. Not the top of the mountain, but definitely climbing. Let me show you why. Comrade Hat + Silicon Data Center. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2641": "#280 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. White House with Trump Wave. Running the free world, one meme at a time. Only 25 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #15 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. The pulp don't lie, bro. This one's worth the squeeze. 🍊",
  "738": "Rank #281. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #13 out of 1996 Wojaks - top 1% of all Wojaks in the grove. Solid pulp all around. Grove-certified. 🍊",
  "3766": "Top 420 at #282. Being in the top 10% means something. Let's break it down. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! Here's what most people miss: Alien Soyjak + $CHIA. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Laser Eyes adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "2946": "#283 out of 4,200. Top 10% of the grove. This Waifu made the cut. Plus you've got Wizard Glasses - all S-tier providence. The pulp don't lie! Here's what most people miss: Wizard Glasses + Mermaid Waves. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3472": "#284 out of 4,200. Top 10% of the grove. This Monkey Zoo made the cut. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! Full Bepe military loadout. Enlisted in the frog forces. Kek's army. Among all 200 Monkey Zoos, this ranks #20. Top 10% of its own kind. That Eye Patch adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "2998": "#285 out of 4,200. Top 10% of the grove. This Waifu made the cut. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Plus you've got Wizard Drip - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3143": "#286 out of 4,200. Top 10% of the grove. This Baddie made the cut. Alpha Shades + Power Bob - only 2 NFTs share this combination. Less than 0.1% of the grove. The pulp is real with this one. Grove-certified. 🍊",
  "3845": "#287 out of 4,200. Top 10% of the grove. This Alien Waifu made the cut. Halo in Heaven. This one made it. Ascended to meme paradise. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3647": "Rank #288. Not the top of the mountain, but definitely climbing. Let me show you why. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Pirate Hat + Silicon Data Center - only 3 NFTs share this combination. Less than 0.1% of the grove. Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, brother. The grove provides, and it provided well here. Winners win! 🍊👑",
  "2976": "#289 out of 4,200. Top 10% of the grove. This Waifu made the cut. Vintage Dress + $LOVE - only 2 NFTs share this combination. Less than 0.1% of the grove. That Vintage Dress adds solid value too. B-tier providence, but still above average. Top 420 means something. Not everyone makes this list. 🍊",
  "3808": "#290 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. That Hannibal Mask adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4155": "#291 out of 4,200. Top 10% of the grove. This Bepe Waifu made the cut. Here's what most people miss: Bepe Waifu + Sky Dive. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3130": "Rank #292. Not the top of the mountain, but definitely climbing. Let me show you why. But check this - Copium Mask + School Uniform together? Only ONE in existence. That's a true 1-of-1 combo right there. That School Uniform adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4071": "Top 420 at #293. Being in the top 10% means something. Let's break it down. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Pickle Suit + Moms Basement. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Cool Glasses adds solid value too. B-tier providence, but still above average. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "3697": "#294 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. Here's what most people miss: Alien Wojak + Hip Hop Hat. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Night Vision adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "3884": "#295 out of 4,200. Top 10% of the grove. This Alien Baddie made the cut. Alien Baddie + Mermaid Waves - only 2 NFTs share this combination. Less than 0.1% of the grove. Top 420 means something. Not everyone makes this list. 🍊",
  "3992": "Rank #296. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Straitjacket + Moms Basement. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Propeller Hat adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4132": "#297 out of 4,200. Top 10% of the grove. This Bepe Waifu made the cut. Plus you've got Cyber Shades, Bepe Army - all S-tier providence. The pulp don't lie! Matrix Lenses in the Matrix. Red pill accepted. This one sees through the simulation. That Propeller Hat adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "2940": "Rank #298. Not the top of the mountain, but definitely climbing. Let me show you why. Copium Mask + Ponytail - only 2 NFTs share this combination. Less than 0.1% of the grove. Worth the squeeze, TangTard. 🍊",
  "442": "Rank #299. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! White House with Trump Wave. Running the free world, one meme at a time. Only 25 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #14 out of 1996 Wojaks - top 1% of all Wojaks in the grove. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2801": "#300 out of 4,200. Top 10% of the grove. This Waifu made the cut. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. The grove blessed this one. Winners win! 🍊👑",
  "3669": "#301 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. Plus you've got Ronin Helmet, Ronin - all S-tier providence. The pulp don't lie! Full Ronin loadout - helmet, robes, and dojo. The masterless warrior found his path. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4010": "#302 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. 3D Glasses + $BEPE - only 2 NFTs share this combination. Less than 0.1% of the grove. Worth the squeeze, Neckbeard. 🍊",
  "3711": "Rank #303. Not the top of the mountain, but definitely climbing. Let me show you why. Alien Wojak + 2Pac Bandana. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3859": "#304 out of 4,200. Top 10% of the grove. This Alien Waifu made the cut. Here's what most people miss: Alien Waifu + Viking Helmet. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3700": "Rank #305. Not the top of the mountain, but definitely climbing. Let me show you why. Here's what most people miss: Alien Wojak + Propeller Hat. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Propeller Hat adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4067": "Rank #306. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! But check this - Stunned + Nesting Grounds together? Only ONE in existence. That's a true 1-of-1 combo right there. That Cool Glasses adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "4160": "Top 420 at #307. Being in the top 10% means something. Let's break it down. Vixen Waves + Moon - only 2 NFTs share this combination. Less than 0.1% of the grove. Top 420 means something. Not everyone makes this list. 🍊",
  "3180": "Rank #308. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Ronin Helmet - all S-tier providence. The pulp don't lie! Here's what most people miss: Matrix Lenses + Vintage Dress. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Vintage Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2504": "Top 420 at #309. Being in the top 10% means something. Let's break it down. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Pirate Hat on Pirate Ship. X marks the spot. This captain found the treasure. This is #16 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. That Hannibal Mask adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3792": "#310 out of 4,200. Top 10% of the grove. This Alien Soyjak made the cut. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 When the traits align like this, you pay attention. Winners win! 🍊👑",
  "3393": "Top 420 at #311. Being in the top 10% means something. Let's break it down. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #9 out of 250 Papa Tangs - top 4% of all Papa Tangs in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3078": "#312 out of 4,200. Top 10% of the grove. This Baddie made the cut. Plus you've got Pepe Suit - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. Good traits, good position, good energy. Grove-certified. 🍊",
  "3680": "Top 420 at #313. Being in the top 10% means something. Let's break it down. That Beret. The beret stays on, brother. Non-negotiable. S-tier providence right there. Neckbeard detected. This is heritage. This is culture. This is winning. Winners win! 👑 Plus you've got Wizard Glasses, El Presidente - all S-tier providence. The pulp don't lie! Here's what most people miss: Wizard Glasses + El Presidente. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "2446": "#314 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Vampire Teeth in Mom's Basement. Hasn't seen sunlight in months. Still plotting. Still winning. Only 10 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #17 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3186": "Rank #315. Not the top of the mountain, but definitely climbing. Let me show you why. But check this - Shades + Power Bob together? Only ONE in existence. That's a true 1-of-1 combo right there. That Vintage Dress adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "2985": "Top 420 at #316. Being in the top 10% means something. Let's break it down. Plus you've got Clown - all S-tier providence. The pulp don't lie! Here's what most people miss: Clown + Vintage Dress. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Vintage Dress adds solid value too. B-tier providence, but still above average. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "2917": "Top 420 at #317. Being in the top 10% means something. Let's break it down. Matrix Lenses in the Matrix. Red pill accepted. This one sees through the simulation. That School Uniform adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "2960": "Top 420 at #318. Being in the top 10% means something. Let's break it down. Glossed Lips + Laser Eyes. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Laser Eyes adds solid value too. B-tier providence, but still above average. The grove blessed this one. Winners win! 🍊👑",
  "3101": "Top 420 at #319. Being in the top 10% means something. Let's break it down. But check this - Pipe + Twin Braids together? Only ONE in existence. That's a true 1-of-1 combo right there. That Proof of Prayer adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4024": "Top 420 at #320. Being in the top 10% means something. Let's break it down. Here's what most people miss: Bepe Soyjak + Signal Lost. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Astronaut adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4135": "#321 out of 4,200. Top 10% of the grove. This Bepe Waifu made the cut. Crown holder right here. 👑 This isn't just S-tier providence, this is the S-tier. Royal Club. Winners win! Bepe Waifu + Crown - only 2 NFTs share this combination. Less than 0.1% of the grove. The pulp don't lie, Neckbeard. This one's worth the squeeze. 🍊",
  "3085": "#322 out of 4,200. Top 10% of the grove. This Baddie made the cut. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Prom Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "432": "#323 out of 4,200. Top 10% of the grove. This Wojak made the cut. 2Pac Bandana + Viking Armor. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #15 out of 1996 Wojaks - top 1% of all Wojaks in the grove. You stumbled onto something real here, bro. Winners win! 🍊👑",
  "3714": "Top 420 at #324. Being in the top 10% means something. Let's break it down. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. But check this - Alien Wojak + Cap together? Only ONE in existence. That's a true 1-of-1 combo right there. You stumbled onto something real here, bro. Winners win! 🍊👑",
  "4035": "#325 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. Route 66 + Born to Ride together - that's the Route 66 Rider combo. 71 total in the grove. That Night Vision adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3473": "#326 out of 4,200. Top 10% of the grove. This Monkey Zoo made the cut. Plus you've got Tin Foil Hat, Bepe Army - all S-tier providence. The pulp don't lie! Tin Foil Hat + NYSE Pump. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, brother. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "4091": "#327 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. Trump Wave + Sports Jacket - only 2 NFTs share this combination. Less than 0.1% of the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3116": "#328 out of 4,200. Top 10% of the grove. This Baddie made the cut. Plus you've got Pirate Hat, Ronin - all S-tier providence. The pulp don't lie! Pirate Hat on Pirate Ship. X marks the spot. This captain found the treasure. That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3084": "Rank #329. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2932": "Rank #330. Not the top of the mountain, but definitely climbing. Let me show you why. Sexy Lip Bite + Twin Braids - only 3 NFTs share this combination. Less than 0.1% of the grove. Top 420 means something. Not everyone makes this list. 🍊",
  "1008": "Top 420 at #331. Being in the top 10% means something. Let's break it down. Plus you've got Wizard Glasses - all S-tier providence. The pulp don't lie! 2Pac Bandana + NYSE Dump. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #16 out of 1996 Wojaks - top 1% of all Wojaks in the grove. That Ninja Turtle Fit adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3092": "Rank #332. Not the top of the mountain, but definitely climbing. Let me show you why. Here's what most people miss: NPC + Power Bob. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Prom Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "2933": "Top 420 at #333. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Cyber Shades + Sports Bra - only 2 NFTs share this combination. Less than 0.1% of the grove. Solid pulp all around. Grove-certified. 🍊",
  "3599": "Top 420 at #334. Being in the top 10% means something. Let's break it down. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Pizza mouth on $PIZZA background. Every day is pizza day for this one. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, brother. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3771": "#335 out of 4,200. Top 10% of the grove. This Alien Soyjak made the cut. Plus you've got Fedora - all S-tier providence. The pulp don't lie! Bathrobe + Morning Routine together - that's the Morning Routine combo. 21 total in the grove. Born different, stays different. Winners win! 🍊👑",
  "2772": "Rank #336. Not the top of the mountain, but definitely climbing. Let me show you why. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. That Beanie adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2814": "Rank #337. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! Goose Suit on $HONK background? HONK HONK! Peace was never an option. Only 4 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2727": "Top 420 at #338. Being in the top 10% means something. Let's break it down. Plus you've got Clown Nose, Super Saiyan Uniform - all S-tier providence. The pulp don't lie! Clown Nose + Cowboy Hat. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #18 out of 750 Soyjaks - top 2% of all Soyjaks in the grove. You're holding something special and I need you to understand that. Winners win! 🍊👑",
  "3666": "Rank #339. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got VR Headset, Pickle Suit - all S-tier providence. The pulp don't lie! VR Headset + Pickle Suit. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3029": "Rank #340. Not the top of the mountain, but definitely climbing. Let me show you why. Here's what most people miss: Ponytail + Morning Routine. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Chia Farmer adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "3831": "Top 420 at #341. Being in the top 10% means something. Let's break it down. But check this - Alien Waifu + Bathrobe together? Only ONE in existence. That's a true 1-of-1 combo right there. That Beanie adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3939": "#342 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. The Crown though. You know what that means? Citrus royalty. The community has spoken and this is THE trait everyone hunts for. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Heaven background with divine energy. This one ascended. The meme gods accepted another soul. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3850": "#343 out of 4,200. Top 10% of the grove. This Alien Waifu made the cut. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Matrix Lenses in the Matrix. Red pill accepted. This one sees through the simulation. The grove blessed this one. Winners win! 🍊👑",
  "2397": "Rank #344. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Tin Foil Hat, Ronin - all S-tier providence. The pulp don't lie! Stunned + Shades. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #19 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3662": "Top 420 at #345. Being in the top 10% means something. Let's break it down. Plus you've got Devil Horns, Leather Jacket - all S-tier providence. The pulp don't lie! Devil Horns in Hell where they belong. Some chose chaos. Chaos chose back. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Night Vision adds solid value too. B-tier providence, but still above average. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "2919": "Top 420 at #346. Being in the top 10% means something. Let's break it down. Plus you've got Ronin Helmet - all S-tier providence. The pulp don't lie! Full Ronin loadout - helmet, robes, and dojo. The masterless warrior found his path. That School Uniform adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3770": "Rank #347. Not the top of the mountain, but definitely climbing. Let me show you why. First things first - that Crown. 👑 Most wanted trait in the entire collection. Royal Club status, Neckbeard. Winners win! Astronaut on the Moon. One small step for Wojak, one giant leap for TangGang. Only 26 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Astronaut adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3751": "Rank #348. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Devil Horns, Leather Jacket - all S-tier providence. The pulp don't lie! Devil Horns in Hell where they belong. Some chose chaos. Chaos chose back. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 That Eye Patch adds solid value too. B-tier providence, but still above average. Not everyone gets this lucky. Winners win! 🍊👑",
  "42": "#349 out of 4,200. Top 10% of the grove. This Wojak made the cut. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Crazy Room, Straitjacket, and that mask... bro, they tried to contain this one. The mask stays on for everyone's safety. Only 30 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #17 out of 1996 Wojaks - top 1% of all Wojaks in the grove. The grove blessed this one. Winners win! 🍊👑",
  "3686": "Top 420 at #350. Being in the top 10% means something. Let's break it down. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. That Chia Farmer adds solid value too. B-tier providence, but still above average. This one was destined to stand out. Winners win! 🍊👑",
  "4134": "Rank #351. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Route 66 + Leather Jacket together - that's the Route 66 Rider combo. 71 total in the grove. That Cool Glasses adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2777": "#352 out of 4,200. Top 10% of the grove. This Waifu made the cut. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. But check this - Sexy Lip Bite + Chia Farmer together? Only ONE in existence. That's a true 1-of-1 combo right there. That Chia Farmer adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "2930": "Top 420 at #353. Being in the top 10% means something. Let's break it down. Shades + Tiara. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Tiara adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3926": "Top 420 at #354. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades, Devil Horns - all S-tier providence. The pulp don't lie! Bepe Wojak + Devil Horns - only 3 NFTs share this combination. Less than 0.1% of the grove. That Drac adds solid value too. B-tier providence, but still above average. This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "2201": "Rank #355. Not the top of the mountain, but definitely climbing. Let me show you why. That Beret. The beret stays on, brother. Non-negotiable. S-tier providence right there. Plus you've got El Presidente - all S-tier providence. The pulp don't lie! Military Beret + NYSE Pump - only 2 NFTs share this combination. Less than 0.1% of the grove. This is #20 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2810": "#356 out of 4,200. Top 10% of the grove. This Waifu made the cut. Here's what most people miss: Terminator + Tiara. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Tiara adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3093": "Rank #357. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. That Prom Dress adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4093": "Top 420 at #358. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades, Straitjacket - all S-tier providence. The pulp don't lie! Straitjacket + Moon. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4175": "#359 out of 4,200. Top 10% of the grove. This Bepe Baddie made the cut. Plus you've got Cyber Shades, Leather Jacket - all S-tier providence. The pulp don't lie! But check this - Bepe Baddie + Leather Jacket together? Only ONE in existence. That's a true 1-of-1 combo right there. That Propeller Hat adds solid value too. B-tier providence, but still above average. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2310": "#360 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Standard Cut + Leather Jacket - only 2 NFTs share this combination. Less than 0.1% of the grove. This is #21 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. Good traits, good position, good energy. Grove-certified. 🍊",
  "3764": "Top 420 at #361. Being in the top 10% means something. Let's break it down. That Beret. The beret stays on, TangTard. Non-negotiable. S-tier providence right there. Alien Soyjak + Eye Patch - only 3 NFTs share this combination. Less than 0.1% of the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3374": "Rank #362. Not the top of the mountain, but definitely climbing. Let me show you why. Bleeding Bags + Price Up - only 2 NFTs share this combination. Less than 0.1% of the grove. This is #10 out of 250 Papa Tangs - top 4% of all Papa Tangs in the grove. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3676": "Top 420 at #363. Being in the top 10% means something. Let's break it down. That Neckbeard though. You're part of the culture now. Winners win, and Neckbeards win most. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! Alien Wojak + Tin Foil Hat - only 2 NFTs share this combination. Less than 0.1% of the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2068": "Top 420 at #364. Being in the top 10% means something. Let's break it down. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! Goose Suit on $HONK background? HONK HONK! Peace was never an option. Only 4 NFTs in the collection have this combo. Worth the squeeze. 🍊 This is #22 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4118": "Top 420 at #365. Being in the top 10% means something. Let's break it down. Bathrobe + Morning Routine together - that's the Morning Routine combo. 21 total in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4072": "Rank #366. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pickle Suit - all S-tier providence. The pulp don't lie! Bepe Soyjak + Pickle Suit - only 2 NFTs share this combination. Less than 0.1% of the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "2797": "#367 out of 4,200. Top 10% of the grove. This Waifu made the cut. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! NPC + NYSE Rug. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3416": "Rank #368. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Beer Hat - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #11 out of 250 Papa Tangs - top 4% of all Papa Tangs in the grove. Good traits, good position, good energy. Grove-certified. 🍊",
  "3565": "#369 out of 4,200. Top 10% of the grove. This Monkey Zoo made the cut. Everything's Fine background with Firefighter gear. When the market burns, this one responds. Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, Neckbeard. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. The pulp don't lie, Neckbeard. This one's worth the squeeze. 🍊",
  "4044": "#370 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Neckbeard trait - the culture, brother. Winners win! The entire providence system was built around this. Plus you've got El Presidente - all S-tier providence. The pulp don't lie! But check this - Aviators + El Presidente together? Only ONE in existence. That's a true 1-of-1 combo right there. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3691": "Top 420 at #371. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades, Devil Horns - all S-tier providence. The pulp don't lie! Joint + Devil Horns - only 2 NFTs share this combination. Less than 0.1% of the grove. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3226": "#372 out of 4,200. Top 10% of the grove. This Papa Tang made the cut. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! Bandana Mask + Hard Hat - only 2 NFTs share this combination. Less than 0.1% of the grove. This is #12 out of 250 Papa Tangs - top 5% of all Papa Tangs in the grove. Solid pulp all around. Grove-certified. 🍊",
  "3682": "Top 420 at #373. Being in the top 10% means something. Let's break it down. Here's what most people miss: Alien Wojak + Headphones. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 That Drac adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2343": "Top 420 at #374. Being in the top 10% means something. Let's break it down. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Stunned + Cyber Shades - only 3 NFTs share this combination. Less than 0.1% of the grove. This is #23 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. That Trump Wave adds solid value too. B-tier providence, but still above average. Solid pulp all around. Grove-certified. 🍊",
  "2805": "Rank #375. Not the top of the mountain, but definitely climbing. Let me show you why. Halo in Heaven. This one made it. Ascended to meme paradise. Worth the squeeze, brother. 🍊",
  "2809": "Top 420 at #376. Being in the top 10% means something. Let's break it down. Cohiba + Twin Braids. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "3051": "Top 420 at #377. Being in the top 10% means something. Let's break it down. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! But check this - Power Bob + Goose Suit together? Only ONE in existence. That's a true 1-of-1 combo right there. The grove blessed this one. Winners win! 🍊👑",
  "3433": "Rank #378. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Pirate Hat - all S-tier providence. The pulp don't lie! Pirate Hat + Nesting Grounds - only 2 NFTs share this combination. Less than 0.1% of the grove. Among all 250 Papa Tangs, this ranks #13. Top 10% of its own kind. Solid pulp all around. Grove-certified. 🍊",
  "3813": "#379 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Viking Helmet plus Viking Armor. Valhalla awaits. The raiders came correct. Good traits, good position, good energy. Grove-certified. 🍊",
  "2702": "#380 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Plus you've got Super Saiyan Uniform - all S-tier providence. The pulp don't lie! But check this - Aviators + Soy Hair together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #24 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "4147": "Rank #381. Not the top of the mountain, but definitely climbing. Let me show you why. But check this - Bepe Waifu + Sports Jacket together? Only ONE in existence. That's a true 1-of-1 combo right there. This is concentrated pulp, bro. The real deal. Winners win! 🍊",
  "2575": "Top 420 at #382. Being in the top 10% means something. Let's break it down. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! Full Bepe military loadout. Enlisted in the frog forces. Kek's army. This is #25 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3912": "#383 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. That Beret. The beret stays on, TangTard. Non-negotiable. S-tier providence right there. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! The Bepe Wojak + Laser Eyes pairing shows up in only 4 NFTs. Rare combination energy. That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "2270": "#384 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Here's what most people miss: Standard Cut + $LOVE. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #26 out of 750 Soyjaks - top 3% of all Soyjaks in the grove. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑",
  "2800": "Rank #385. Not the top of the mountain, but definitely climbing. Let me show you why. But check this - Rekt + Power Bob together? Only ONE in existence. That's a true 1-of-1 combo right there. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3146": "#386 out of 4,200. Top 10% of the grove. This Baddie made the cut. First things first - that Crown. 👑 Most wanted trait in the entire collection. Royal Club status, TangTard. Winners win! But check this - Pipe + Sports Bra together? Only ONE in existence. That's a true 1-of-1 combo right there. That Cool Glasses adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "4019": "#387 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. Plus you've got Cyber Shades, Wizard Hat - all S-tier providence. The pulp don't lie! Spell Room + Wizard Hat + Wizard Drip together - that's the Full Wizard combo. 148 total in the grove. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "27": "#388 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. Neckbeard trait - the culture, bro. Winners win! The entire providence system was built around this. Plus you've got Cyber Shades, Leather Jacket - all S-tier providence. The pulp don't lie! Neckbeard on $NECKCOIN. The official currency of winners. This is culture. Only 17 NFTs in the collection have this combo. Worth the squeeze. 🍊 This combination doesn't just happen. The stars aligned. Winners win! 🍊👑",
  "3554": "Rank #389. Not the top of the mountain, but definitely climbing. Let me show you why. The Crown though. You know what that means? Citrus royalty. The community has spoken and this is THE trait everyone hunts for. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Plus you've got Ronin - all S-tier providence. The pulp don't lie! Joint + $NECKCOIN - only 3 NFTs share this combination. Less than 0.1% of the grove. Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, brother. Most will never hold something like this. Winners win! 🍊👑",
  "4065": "#390 out of 4,200. Top 10% of the grove. This Bepe Soyjak made the cut. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3710": "Rank #391. Not the top of the mountain, but definitely climbing. Let me show you why. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Neckbeard detected. This is heritage. This is culture. This is winning. Winners win! 👑 But check this - Military Beret + Astronaut together? Only ONE in existence. That's a true 1-of-1 combo right there. That Astronaut adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2840": "Top 420 at #392. Being in the top 10% means something. Let's break it down. Ninja Turtle Mask AND Fit. Cowabunga, bro! Heroes in a half shell. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. The pulp don't lie, bro. This one's worth the squeeze. 🍊",
  "2611": "Rank #393. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Clown Nose - all S-tier providence. The pulp don't lie! Here's what most people miss: Stache + Golden Hour. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is #27 out of 750 Soyjaks - top 4% of all Soyjaks in the grove. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "3246": "Top 420 at #394. Being in the top 10% means something. Let's break it down. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. Among all 250 Papa Tangs, this ranks #14. Top 10% of its own kind. Whoever minted this knew what they were doing. Winners win! 🍊👑",
  "2375": "#395 out of 4,200. Top 10% of the grove. This Soyjak made the cut. Plus you've got Wizard Glasses, Ronin - all S-tier providence. The pulp don't lie! Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #28 out of 750 Soyjaks - top 4% of all Soyjaks in the grove. This is concentrated pulp, brother. The real deal. Winners win! 🍊",
  "3383": "#396 out of 4,200. Top 10% of the grove. This Papa Tang made the cut. But check this - Rekt + Headphones together? Only ONE in existence. That's a true 1-of-1 combo right there. Among all 250 Papa Tangs, this ranks #15. Top 10% of its own kind. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2791": "Top 420 at #397. Being in the top 10% means something. Let's break it down. Comrade Hat + Denim Vest. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! Most will never hold something like this. Winners win! 🍊👑",
  "3765": "Rank #398. Not the top of the mountain, but definitely climbing. Let me show you why. Military Beret equipped. You know the rules - the beret stays on. Always. Second most wanted trait in the grove. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Here's what most people miss: Military Beret + Hell. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "4150": "Top 420 at #399. Being in the top 10% means something. Let's break it down. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. But check this - Bepe Waifu + Cig together? Only ONE in existence. That's a true 1-of-1 combo right there. That Suit adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "64": "#400 out of 4,200. Top 10% of the grove. This Wojak made the cut. Plus you've got VR Headset - all S-tier providence. The pulp don't lie! Heaven background with divine energy. This one ascended. The meme gods accepted another soul. This is #18 out of 1996 Wojaks - top 1% of all Wojaks in the grove. Solid pulp all around. Grove-certified. 🍊",
  "4009": "Top 420 at #401. Being in the top 10% means something. Let's break it down. MOG Glasses on. You can't teach this energy - either you have it or you don't. This one has it. Here's what most people miss: MOG Glasses + Standard Cut. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 This one was destined to stand out. Winners win! 🍊👑",
  "2758": "#402 out of 4,200. Top 10% of the grove. This Waifu made the cut. Laser Eyes + Orange Grove - only 3 NFTs share this combination. Less than 0.1% of the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "3050": "#403 out of 4,200. Top 10% of the grove. This Baddie made the cut. Plus you've got Goose Suit - all S-tier providence. The pulp don't lie! Here's what most people miss: Ponytail + Goose Suit. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3758": "Rank #404. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Clown Nose, Clown - all S-tier providence. The pulp don't lie! Clown head AND Clown Nose. Full honk mode activated. Maximum chaos achieved. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "2153": "Top 420 at #405. Being in the top 10% means something. Let's break it down. Plus you've got Straitjacket - all S-tier providence. The pulp don't lie! Bubble Gum + Soy Hair. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #29 out of 750 Soyjaks - top 4% of all Soyjaks in the grove. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "3184": "Top 420 at #406. Being in the top 10% means something. Let's break it down. But check this - Vintage Dress + Morning Routine together? Only ONE in existence. That's a true 1-of-1 combo right there. That Vintage Dress adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "2512": "Rank #407. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! Cig + Signal Lost. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! This is #30 out of 750 Soyjaks - top 4% of all Soyjaks in the grove. When the traits align like this, you pay attention. Winners win! 🍊👑",
  "2827": "Top 420 at #408. Being in the top 10% means something. Let's break it down. Plus you've got Leather Jacket - all S-tier providence. The pulp don't lie! Waifu + $NECKCOIN - only 2 NFTs share this combination. Less than 0.1% of the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. Good traits, good position, good energy. Grove-certified. 🍊",
  "4130": "Top 420 at #409. Being in the top 10% means something. Let's break it down. Halo in Heaven. This one made it. Ascended to meme paradise. This is concentrated pulp, TangTard. The real deal. Winners win! 🍊",
  "3404": "Rank #410. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Tin Foil Hat - all S-tier providence. The pulp don't lie! 3D Glasses + Moms Basement - only 3 NFTs share this combination. Less than 0.1% of the grove. Among all 250 Papa Tangs, this ranks #16. Top 10% of its own kind. Solid pulp all around. Grove-certified. 🍊",
  "3552": "Top 420 at #411. Being in the top 10% means something. Let's break it down. Military Beret. Some things you don't take off. This is one of them. The beret stays on. Winners win! Plus you've got Ronin - all S-tier providence. The pulp don't lie! Ronin + Bepe Barracks - only 3 NFTs share this combination. Less than 0.1% of the grove. Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, Neckbeard. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3693": "Rank #412. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Fake It Mask - all S-tier providence. The pulp don't lie! Alien Wojak + NYSE Dump - only 2 NFTs share this combination. Less than 0.1% of the grove. Solid pulp all around. Grove-certified. 🍊",
  "3212": "#413 out of 4,200. Top 10% of the grove. This Papa Tang made the cut. Plus you've got Cyber Shades - all S-tier providence. The pulp don't lie! Cyber Shades + Field Cap - only 3 NFTs share this combination. Less than 0.1% of the grove. Among all 250 Papa Tangs, this ranks #17. Top 10% of its own kind. Good traits, good position, good energy. Grove-certified. 🍊",
  "4149": "Top 420 at #414. Being in the top 10% means something. Let's break it down. Power Bob + Suit. Bro. One. That's it. One NFT in the entire collection. The pulp don't lie! That Suit adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "2562": "Top 420 at #415. Being in the top 10% means something. Let's break it down. Plus you've got Bepe Army - all S-tier providence. The pulp don't lie! But check this - NPC + $NECKCOIN together? Only ONE in existence. That's a true 1-of-1 combo right there. This is #31 out of 750 Soyjaks - top 4% of all Soyjaks in the grove. That Eye Patch adds solid value too. B-tier providence, but still above average. Grove-certified grail status. The pulp don't lie! 🍊🔥",
  "775": "Top 420 at #416. Being in the top 10% means something. Let's break it down. Price dumping, bags bleeding... we've all been there bro. But the ones who stay become legends. This is #19 out of 1996 Wojaks - top 1% of all Wojaks in the grove. That Laser Eyes adds solid value too. B-tier providence, but still above average. This is concentrated pulp, Neckbeard. The real deal. Winners win! 🍊",
  "3812": "#417 out of 4,200. Top 10% of the grove. This Alien Wojak made the cut. Alien Wojak + Trump Wave - only 2 NFTs share this combination. Less than 0.1% of the grove. That Trump Wave adds solid value too. B-tier providence, but still above average. Worth the squeeze, Neckbeard. 🍊",
  "3934": "#418 out of 4,200. Top 10% of the grove. This Bepe Wojak made the cut. Those MOG Glasses though. Asserting dominance just by existing. S-tier face wear, no question. Everything's Fine background with Firefighter gear. When the market burns, this one responds. The pulp don't lie, bro. This one's worth the squeeze. 🍊",
  "2939": "#419 out of 4,200. Top 10% of the grove. This Waifu made the cut. Ninja Turtle Mask + Power Bob - only 2 NFTs share this combination. Less than 0.1% of the grove. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. The pulp is real with this one. Grove-certified. 🍊",
  "3553": "Rank #420. Not the top of the mountain, but definitely climbing. Let me show you why. Plus you've got Ronin - all S-tier providence. The pulp don't lie! Here's what most people miss: Ninja Turtle Mask + Rainforest. ONE NFT has this combo. One out of 4,200. You're looking at a 1-of-1 pairing. 🔥 Monkey Zoo base - OG ape of the Chia blockchain. This base carries cultural weight, bro. That Ninja Turtle Mask adds solid value too. B-tier providence, but still above average. I've seen 4,200 NFTs. This one stands out. Winners win! 🍊👑"
}