{
  "3729": "Top 10 at #1 — this Alien Wojak is in a league most won't reach. Full Piccolo with Turban and Uniform together — only 7 exist. Among all 100 Alien Wojaks, this one ranks first — the single best Alien Wojak. Also carrying Fake It Mask — these add depth to the profile.",
  "3707": "Top 10 at #2 — this Alien Wojak is in a league most won't reach. Full Piccolo with Turban and Uniform together — only 7 exist. Within 100 Alien Wojaks, this ranks #2 — top 3 of its kind.",
  "3728": "Top 10 at #3 — this Alien Wojak is in a league most won't reach. Full Piccolo with Turban and Uniform together — only 7 exist. Number #3 among 100 Alien Wojaks — elite within the base. Grove-approved. 🍊",
  "3705": "This Alien Wojak sits at rank #4, placing it in the top 10 of the entire collection. Full Piccolo with Turban and Uniform together — only 7 exist. Out of 100 Alien Wojaks, this sits at #4 — top 10% of the base.",
  "3703": "Top 10 at #5 — this Alien Wojak is in a league most won't reach. Full Piccolo with Turban and Uniform together — only 7 exist. Out of 100 Alien Wojaks, this sits at #5 — top 10% of the base.",
  "3704": "Top 10 at #6 — this Alien Wojak is in a league most won't reach. Full Piccolo with Turban and Uniform together — only 7 exist. Position #6 out of 100 Alien Wojaks total.",
  "3137": "This Baddie sits at rank #7, placing it in the top 10 of the entire collection. The best Baddie in existence, ranking first out of 200. Clown Nose round out the loadout nicely.",
  "4121": "Top 10 at #8 — this Bepe Waifu is in a league most won't reach. Bepe Waifu + Aviators together shows up 2 times total — tiny supply. Number one out of 42 Bepe Waifus — top of the base class.",
  "4186": "Rank #9 out of 4,200 — top 10 territory for this Bepe Baddie. Only 2 pieces have Bepe Baddie + Cyber Shades — scarce combo. Number one out of 42 Bepe Baddies — top of the base class.",
  "3733": "This Alien Soyjak sits at rank #10, placing it in the top 10 of the entire collection. Vampire Teeth in Mom's Basement — hasn't touched grass, still winning. Among all 80 Alien Soyjaks, this one ranks first — the single best Alien Soyjak. Pulp check: verified. 🍊",
  "2157": "This Soyjak landed at #11, comfortably in the top 1.2%. Pizza + Soy Hair together appears once in 4,200 — that's a 1-of-1 situation. Number one out of 750 Soyjaks — top of the base class.",
  "4148": "Rank #12 puts this Bepe Waifu in the top 50, ahead of over 4,100 pieces. The Bepe Waifu + Prom Dress pairing exists on exactly one NFT — true 1-of-1 combo. Within 42 Bepe Waifus, this ranks #2 — top 3 of its kind.",
  "4145": "This Bepe Waifu landed at #13, comfortably in the top 1.2%. The Bepe Waifu + $BEPE pairing exists on exactly one NFT — true 1-of-1 combo. Within 42 Bepe Waifus, this ranks #3 — top 3 of its kind.",
  "3840": "Number #14 in the grove, top 50 status confirmed. Ninja Turtle set complete — cowabunga. Number one out of 35 Alien Waifus — top of the base class.",
  "4154": "At #15, this Bepe Waifu made top 50 — that's collector territory. Aviators + Twin Braids together appears once in 4,200 — that's a 1-of-1 situation. Out of 42 Bepe Waifus, this sits at #4 — top 10% of the base.",
  "4122": "At #16, this Bepe Waifu made top 50 — that's collector territory. The Bepe Waifu + Bepe Suit pairing exists on exactly one NFT — true 1-of-1 combo. The Cool Glasses + Mermaid Waves pairing adds scarcity, only 2 exist. Backing it up with Bepe Suit. Grove-approved. 🍊",
  "2160": "Number #17 in the grove, top 50 status confirmed. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Number #2 among 750 Soyjaks — elite within the base.",
  "3779": "This Alien Soyjak landed at #18, comfortably in the top 1.2%. Only one NFT has the Alien Soyjak + NYSE Dump combination — unique pairing alert. Number #2 among 80 Alien Soyjaks — elite within the base.",
  "3936": "Rank #19 puts this Bepe Wojak in the top 50, ahead of over 4,100 pieces. Standard Cut + Hell is a 1-of-1 combo — no duplicates in the collection. Among all 124 Bepe Wojaks, this one ranks first — the single best Bepe Wojak.",
  "4137": "Number #20 in the grove, top 50 status confirmed. Only one NFT has the Bepe Waifu + 3D Glasses combination — unique pairing alert. Also has Bepe Waifu + Pepe Suit — a 1-of-1 combo. Also carrying Pepe Suit — these add depth to the profile.",
  "4143": "This Bepe Waifu landed at #21, comfortably in the top 1.2%. Bepe Waifu + Cyber Shades appears on just 3 NFTs — collector bait. The Bepe Waifu + Power Bob pairing adds scarcity, only 3 exist. The Cyber Shades add another layer to this piece.",
  "4146": "Number #22 in the grove, top 50 status confirmed. Only one NFT has the Bepe Waifu + Ninja Turtle Mask combination — unique pairing alert. Also has Bepe Waifu + $HOA — a 1-of-1 combo.",
  "3879": "This Alien Baddie landed at #23, comfortably in the top 1.2%. MOG Glasses on — asserting dominance through accessories. The best Alien Baddie in existence, ranking first out of 35.",
  "3457": "Rank #24 puts this Monkey Zoo in the top 50, ahead of over 4,100 pieces. Only one NFT has the VR Headset + 2Pac Bandana combination — unique pairing alert. The best Monkey Zoo in existence, ranking first out of 200. VR Headset round out the loadout nicely.",
  "3843": "Rank #25 puts this Alien Waifu in the top 50, ahead of over 4,100 pieces. Only one NFT has the Aviators + Mermaid Waves combination — unique pairing alert. Top 3 Alien Waifu at position #2 out of 35.",
  "4189": "At #26, this Bepe Baddie made top 50 — that's collector territory. Bepe Baddie + Prom Dress together appears once in 4,200 — that's a 1-of-1 situation. Top 3 Bepe Baddie at position #2 out of 42.",
  "3769": "This Alien Soyjak landed at #27, comfortably in the top 1.2%. The Cyber Shades + Standard Cut pairing exists on exactly one NFT — true 1-of-1 combo. Within 80 Alien Soyjaks, this ranks #3 — top 3 of its kind. The Cyber Shades and El Presidente add another layer to this piece.",
  "4164": "Number #28 in the grove, top 50 status confirmed. Within 42 Bepe Baddies, this ranks #3 — top 3 of its kind. Solid piece with defensible traits.",
  "2883": "This Waifu landed at #29, comfortably in the top 1.2%. Number one out of 250 Waifus — top of the base class. Also carrying Fake It Mask — these add depth to the profile.",
  "4162": "Number #30 in the grove, top 50 status confirmed. MOG Glasses are peak face wear — collectors hunt for these. Ranks #4 among 42 Bepe Baddies — upper tier within class.",
  "4163": "At #31, this Bepe Baddie made top 50 — that's collector territory. MOG Glasses on — asserting dominance through accessories. Also has Bepe Baddie + Bepe Suit — a 1-of-1 combo. The Bepe Suit add another layer to this piece.",
  "2983": "Number #32 in the grove, top 50 status confirmed. The NPC + Tiara pairing exists on exactly one NFT — true 1-of-1 combo. Top 3 Waifu at position #2 out of 250.",
  "3841": "This Alien Waifu landed at #33, comfortably in the top 1.2%. The Alien Waifu + Fedora pairing exists on exactly one NFT — true 1-of-1 combo. Number #3 among 35 Alien Waifus — elite within the base.",
  "3706": "At #34, this Alien Wojak made top 50 — that's collector territory. Full Piccolo with Turban and Uniform together — only 7 exist. Ranks #7 among 100 Alien Wojaks — upper tier within class. Grove-approved. 🍊",
  "4196": "This Bepe Baddie landed at #35, comfortably in the top 1.2%. The Bepe Baddie + Rekt pairing only appears on 2 NFTs — low print. The Ponytail + Denim Vest pairing adds scarcity, only 2 exist.",
  "2742": "Number #36 in the grove, top 50 status confirmed. Only one NFT has the Rugged + Soy Hair combination — unique pairing alert. Top 3 Soyjak at position #3 out of 750. Backing it up with Cyber Shades and Super Saiyan Uniform. Pulp check: verified. 🍊",
  "3723": "This Alien Wojak landed at #37, comfortably in the top 1.2%. Rugged + Piccolo Turban is a 1-of-1 combo — no duplicates in the collection. Position #8 out of 100 Alien Wojaks total.",
  "2796": "At #38, this Waifu made top 50 — that's collector territory. Only one NFT has the Sexy Lip Bite + Tangerine Pop combination — unique pairing alert. Top 3 Waifu at position #3 out of 250. Backing it up with Cyber Shades. Grove-approved. 🍊",
  "3081": "This Baddie landed at #39, comfortably in the top 1.2%. Only one NFT has the Alpha Shades + Twin Braids combination — unique pairing alert. Within 200 Baddies, this ranks #2 — top 3 of its kind. Grove-approved. 🍊",
  "3787": "At #40, this Alien Soyjak made top 50 — that's collector territory. Alien Soyjak + Rainforest is a 1-of-1 combo — no duplicates in the collection. Out of 80 Alien Soyjaks, this sits at #4 — top 10% of the base.",
  "3892": "This Alien Baddie landed at #41, comfortably in the top 1.2%. Clown head with Clown Nose — maximum honk mode. Top 3 Alien Baddie at position #2 out of 35. Citrus certified. 🍊",
  "3856": "Number #42 in the grove, top 50 status confirmed. Also has Vixen Waves + Moms Basement — a 1-of-1 combo. Solid piece with defensible traits.",
  "4181": "At #43, this Bepe Baddie made top 50 — that's collector territory. Those MOG Glasses signal something. High-demand trait. Also has Bepe Baddie + Silicon Data Center — a 1-of-1 combo.",
  "3730": "Number #44 in the grove, top 50 status confirmed. The Smile + Piccolo Turban pairing exists on exactly one NFT — true 1-of-1 combo. Ranks #9 among 100 Alien Wojaks — upper tier within class.",
  "3900": "Number #45 in the grove, top 50 status confirmed. Devil Horns in Hell where they belong. 🔥 Within 35 Alien Baddies, this ranks #3 — top 3 of its kind.",
  "3780": "Rank #46 puts this Alien Soyjak in the top 50, ahead of over 4,100 pieces. Alien Soyjak + NYSE Rug is a 1-of-1 combo — no duplicates in the collection. Ranks #5 among 80 Alien Soyjaks — upper tier within class. Goose Suit round out the loadout nicely.",
  "3861": "Rank #47 puts this Alien Waifu in the top 50, ahead of over 4,100 pieces. Only one NFT has the Beanie + Sports Bra combination — unique pairing alert. The Alien Waifu + Aviators pairing adds scarcity, only 2 exist.",
  "4193": "Rank #48 puts this Bepe Baddie in the top 50, ahead of over 4,100 pieces. MOG Glasses on — asserting dominance through accessories. The Bepe Baddie + Moon pairing adds scarcity, only 3 exist.",
  "3702": "At #49, this Alien Wojak made top 50 — that's collector territory. The Spikes + Piccolo Uniform pairing exists on exactly one NFT — true 1-of-1 combo. Position #10 out of 100 Alien Wojaks total. Citrus certified. 🍊",
  "3842": "At #50, this Alien Waifu made top 50 — that's collector territory. Those MOG Glasses signal something. High-demand trait. Also has Smile + Mermaid Waves — a 1-of-1 combo.",
  "3860": "Rank #51 means top 2.4% — solid positioning for this Alien Waifu. MOG Glasses are peak face wear — collectors hunt for these. Also has Cap + Sports Bra — a 1-of-1 combo.",
  "3083": "Top 100 at #52 — this Baddie has weight. Laser Eyes + Mermaid Waves together appears once in 4,200 — that's a 1-of-1 situation. Number #3 among 200 Baddies — elite within the base. Also carrying Pickle Suit — these add depth to the profile.",
  "4190": "This Bepe Baddie ranks #53, placing it in the top 100. Bepe Baddie + Alpha Shades appears on just 2 NFTs — collector bait. The Bepe Baddie + Suit pairing adds scarcity, only 2 exist. Citrus certified. 🍊",
  "3778": "At #54, this Alien Soyjak sits in top 100 territory. Clown head with Clown Nose — maximum honk mode. Position #6 out of 80 Alien Soyjaks total. Pulp check: verified. 🍊",
  "4119": "At #55, this Bepe Waifu sits in top 100 territory. Those MOG Glasses signal something. High-demand trait. The Bepe Waifu + Moon pairing adds scarcity, only 2 exist.",
  "3881": "This Alien Baddie ranks #56, placing it in the top 100. Power Bob + Morning Routine is a 1-of-1 combo — no duplicates in the collection. Also has Sports Bra + Morning Routine — a 1-of-1 combo.",
  "2914": "At #57, this Waifu sits in top 100 territory. Only one NFT has the Pipe + Tiara combination — unique pairing alert. Position #4 out of 250 Waifus total.",
  "3076": "Rank #58 means top 2.4% — solid positioning for this Baddie. Sexy Lip Bite + Pepe Suit is a 1-of-1 combo — no duplicates in the collection. Ranks #4 among 200 Baddies — upper tier within class. Also carrying Pepe Suit — these add depth to the profile.",
  "41": "Rank #59 means top 2.4% — solid positioning for this Wojak. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. The best Wojak in existence, ranking first out of 1996.",
  "3796": "Rank #60 means top 2.4% — solid positioning for this Alien Soyjak. Neckbeard is cultural capital. The blade has been studied. Position #7 out of 80 Alien Soyjaks total. Winners win. 👑",
  "3038": "Rank #61 means top 2.4% — solid positioning for this Baddie. Sexy Lip Bite + Mellow Yellow together appears once in 4,200 — that's a 1-of-1 situation. Ranks #5 among 200 Baddies — upper tier within class.",
  "3927": "Top 100 at #62 — this Bepe Wojak has weight. Vampire Teeth in Mom's Basement — hasn't touched grass, still winning. Within 124 Bepe Wojaks, this ranks #2 — top 3 of its kind.",
  "3503": "This Monkey Zoo ranks #63, placing it in the top 100. The Aviators + Headphones pairing exists on exactly one NFT — true 1-of-1 combo. Number #2 among 200 Monkey Zoos — elite within the base.",
  "3890": "Rank #64 means top 2.4% — solid positioning for this Alien Baddie. Also has Alien Baddie + Wizard Glasses — a 1-of-1 combo. Solid piece with defensible traits.",
  "3716": "This Alien Wojak ranks #65, placing it in the top 100. Clown head with Clown Nose — maximum honk mode. The Clown + El Presidente pairing adds scarcity, only 2 exist.",
  "3722": "This Alien Wojak ranks #66, placing it in the top 100. Clown head with Clown Nose — maximum honk mode. The Drac + One Market pairing adds scarcity, only 2 exist.",
  "3718": "Top 100 at #67 — this Alien Wojak has weight. Heaven background with divine traits — this one ascended. Also has Copium Mask + Construction Helmet — a 1-of-1 combo.",
  "4046": "Top 100 at #68 — this Bepe Soyjak has weight. Bepe Soyjak + Fedora together appears once in 4,200 — that's a 1-of-1 situation. Number one out of 96 Bepe Soyjaks — top of the base class.",
  "4185": "Rank #69 means top 2.4% — solid positioning for this Bepe Baddie. Bepe Baddie + Tiara together shows up 2 times total — tiny supply. The School Uniform + Heaven pairing adds scarcity, only 2 exist.",
  "4138": "This Bepe Waifu ranks #70, placing it in the top 100. MOG Glasses are peak face wear — collectors hunt for these. The Bepe Waifu + Bubble Gum pairing adds scarcity, only 2 exist.",
  "3891": "Top 100 at #71 — this Alien Baddie has weight. Also has Alien Baddie + Laser Eyes — a 1-of-1 combo. Solid piece with defensible traits.",
  "3878": "Top 100 at #72 — this Alien Baddie has weight. Alien Baddie + Mermaid Waves together shows up 2 times total — tiny supply. The Alien Baddie + Prom Dress pairing adds scarcity, only 2 exist.",
  "3785": "Rank #73 means top 2.4% — solid positioning for this Alien Soyjak. Halo in Heaven — this one made it. Out of 80 Alien Soyjaks, this sits at #8 — top 10% of the base. The Wizard Drip add another layer to this piece.",
  "3835": "Rank #74 means top 2.4% — solid positioning for this Alien Waifu. Clown head with Clown Nose — maximum honk mode. Also has Alien Waifu + Clown Nose — a 1-of-1 combo.",
  "3080": "Rank #75 means top 2.4% — solid positioning for this Baddie. Pizza traits on $PIZZA — every day is pizza day. Ranks #6 among 200 Baddies — upper tier within class. The Pickle Suit add another layer to this piece. Citrus certified. 🍊",
  "4153": "At #76, this Bepe Waifu sits in top 100 territory. Bepe Waifu + Rekt together shows up 2 times total — tiny supply. The Rekt + Vintage Dress pairing adds scarcity, only 3 exist.",
  "4152": "Top 100 at #77 — this Bepe Waifu has weight. Only one NFT has the Cohiba + Vintage Dress combination — unique pairing alert. The Bepe Waifu + Cohiba pairing adds scarcity, only 2 exist.",
  "3692": "Top 100 at #78 — this Alien Wojak has weight. Pizza traits on $PIZZA — every day is pizza day. Also has Alien Wojak + $PIZZA — a 1-of-1 combo. Fedora round out the loadout nicely. Grove-approved. 🍊",
  "3854": "Rank #79 means top 2.4% — solid positioning for this Alien Waifu. Also has Alien Waifu + Twin Braids — a 1-of-1 combo. Solid piece with defensible traits.",
  "3855": "At #80, this Alien Waifu sits in top 100 territory. The Alien Waifu + Vixen Waves pairing adds scarcity, only 2 exist. Solid piece with defensible traits.",
  "3824": "At #81, this Alien Soyjak sits in top 100 territory. Also has Cowboy Hat + Piccolo Uniform — a 1-of-1 combo. Solid piece with defensible traits.",
  "3767": "Rank #82 means top 2.4% — solid positioning for this Alien Soyjak. Matrix Lenses in the Matrix — red pill accepted. Also has Trump Wave + Matrix — a 1-of-1 combo. Grove-approved. 🍊",
  "4158": "At #83, this Bepe Waifu sits in top 100 territory. Only one NFT has the Bepe Waifu + Alpha Shades combination — unique pairing alert. The Bepe Waifu + Wizard Hat pairing adds scarcity, only 2 exist. Also carrying Wizard Hat — these add depth to the profile.",
  "3849": "Top 100 at #84 — this Alien Waifu has weight. Only one NFT has the Alien Waifu + School Uniform combination — unique pairing alert. Also has Power Bob + Matrix — a 1-of-1 combo. Pulp check: verified. 🍊",
  "2868": "At #85, this Waifu sits in top 100 territory. Pizza + Prom Dress together appears once in 4,200 — that's a 1-of-1 situation. Out of 250 Waifus, this sits at #5 — top 10% of the base. Devil Horns round out the loadout nicely. Pulp check: verified. 🍊",
  "3888": "Rank #86 means top 2.4% — solid positioning for this Alien Baddie. Also has Alien Baddie + Silicon Data Center — a 1-of-1 combo. Solid piece with defensible traits.",
  "3688": "At #87, this Alien Wojak sits in top 100 territory. Everything's Fine with Firefighter gear — when it burns, this one responds. Also has Alien Wojak + Everythings Fine — a 1-of-1 combo.",
  "2867": "At #88, this Waifu sits in top 100 territory. That Crown puts you in the Royal Club — most wanted trait, period. 👑 Ranks #6 among 250 Waifus — upper tier within class.",
  "4051": "This Bepe Soyjak ranks #89, placing it in the top 100. Halo in Heaven — this one made it. Top 3 Bepe Soyjak at position #2 out of 96. Citrus certified. 🍊",
  "3721": "Top 100 at #90 — this Alien Wojak has weight. Heaven background with divine traits — this one ascended. The Alien Wojak + Wizard Glasses pairing adds scarcity, only 3 exist.",
  "46": "Rank #91 means top 2.4% — solid positioning for this Wojak. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Top 3 Wojak at position #2 out of 1996.",
  "2916": "Top 100 at #92 — this Waifu has weight. Waifu + Rainforest is a 1-of-1 combo — no duplicates in the collection. Position #7 out of 250 Waifus total. Grove-approved. 🍊",
  "3672": "This Alien Wojak ranks #93, placing it in the top 100. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Also has Alien Wojak + Cool Glasses — a 1-of-1 combo.",
  "3668": "At #94, this Alien Wojak sits in top 100 territory. Devil Horns in Hell where they belong. 🔥 Also has Bandana Mask + Fake It Mask — a 1-of-1 combo. Citrus certified. 🍊",
  "4194": "At #95, this Bepe Baddie sits in top 100 territory. MOG Glasses on — asserting dominance through accessories. The Vixen Waves + Hell pairing adds scarcity, only 2 exist. Pulp check: verified. 🍊",
  "3458": "This Monkey Zoo ranks #96, placing it in the top 100. Monkey Zoo + Cowboy Hat together shows up 3 times total — tiny supply. Number #3 among 200 Monkey Zoos — elite within the base. Pulp check: verified. 🍊",
  "3862": "At #97, this Alien Waifu sits in top 100 territory. Also has Rugged + Sexy Lip Bite — a 1-of-1 combo. Leather Jacket round out the loadout nicely.",
  "2789": "At #98, this Waifu sits in top 100 territory. The Bleeding Bags + Power Bob pairing exists on exactly one NFT — true 1-of-1 combo. Out of 250 Waifus, this sits at #8 — top 10% of the base. Pulp check: verified. 🍊",
  "4165": "Rank #99 means top 2.4% — solid positioning for this Bepe Baddie. Bepe Baddie + Chia Farmer together appears once in 4,200 — that's a 1-of-1 situation. The Bepe Baddie + Cool Glasses pairing adds scarcity, only 2 exist.",
  "3844": "Rank #100 means top 2.4% — solid positioning for this Alien Waifu. Military Beret is the second most wanted trait, and the beret stays on. Also has Alien Waifu + Copium Mask — a 1-of-1 combo.",
  "4064": "Number #101 overall — top 5% for this Bepe Soyjak. Ninja Turtle set complete — cowabunga. Within 96 Bepe Soyjaks, this ranks #3 — top 3 of its kind. Pulp check: verified. 🍊",
  "3135": "Rank #102 puts this Baddie in the top 5%. Clown head with Clown Nose — maximum honk mode. Out of 200 Baddies, this sits at #7 — top 10% of the base.",
  "4142": "Number #103 overall — top 5% for this Bepe Waifu. The Bepe Waifu + One Market pairing exists on exactly one NFT — true 1-of-1 combo. Also has Tiara + One Market — a 1-of-1 combo.",
  "3894": "This Alien Baddie comes in at #104, top 200 status. Only one NFT has the Alien Baddie + Tiara combination — unique pairing alert. Also has Tiara + Moon — a 1-of-1 combo.",
  "3880": "This Alien Baddie comes in at #105, top 200 status. Only one NFT has the Alien Baddie + Ponytail combination — unique pairing alert. Also has Ponytail + Moon — a 1-of-1 combo.",
  "3748": "Rank #106 puts this Alien Soyjak in the top 5%. Halo in Heaven — this one made it. Also has Alien Soyjak + God's Robe — a 1-of-1 combo.",
  "3797": "Number #107 overall — top 5% for this Alien Soyjak. White House with Trump Wave — main character energy. Also has Alien Soyjak + White House — a 1-of-1 combo.",
  "3057": "Rank #108 puts this Baddie in the top 5%. Pizza traits on $PIZZA — every day is pizza day. Out of 200 Baddies, this sits at #8 — top 10% of the base. Backing it up with Gopher Suit. Grove-approved. 🍊",
  "3026": "This Baddie comes in at #109, top 200 status. Pizza traits on $PIZZA — every day is pizza day. Out of 200 Baddies, this sits at #9 — top 10% of the base.",
  "2934": "Number #110 overall — top 5% for this Waifu. Only one NFT has the Shades + Vixen Waves combination — unique pairing alert. Ranks #9 among 250 Waifus — upper tier within class.",
  "3535": "Number #111 overall — top 5% for this Monkey Zoo. Centurion with Roman Drip — ave, true to Caesar. Position #4 out of 200 Monkey Zoos total.",
  "3570": "At #112, this Monkey Zoo outranks 95% of the grove. MOG Glasses are peak face wear — collectors hunt for these. Ranks #5 among 200 Monkey Zoos — upper tier within class.",
  "4179": "At #113, this Bepe Baddie outranks 95% of the grove. MOG Glasses are peak face wear — collectors hunt for these. Also has Bepe Baddie + Teeth — a 1-of-1 combo. Also carrying Pirate Hat — these add depth to the profile.",
  "47": "At #114, this Wojak outranks 95% of the grove. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Within 1996 Wojaks, this ranks #3 — top 3 of its kind.",
  "3786": "Rank #115 puts this Alien Soyjak in the top 5%. MOG Glasses are peak face wear — collectors hunt for these. The Alien Soyjak + Copium Mask pairing adds scarcity, only 2 exist.",
  "3082": "Number #116 overall — top 5% for this Baddie. The Smile + Ponytail pairing exists on exactly one NFT — true 1-of-1 combo. Ranks #10 among 200 Baddies — upper tier within class. Backing it up with Pickle Suit.",
  "4151": "Number #117 overall — top 5% for this Bepe Waifu. Those MOG Glasses signal something. High-demand trait. The Joint + Vixen Waves pairing adds scarcity, only 3 exist. Grove-approved. 🍊",
  "4140": "Number #118 overall — top 5% for this Bepe Waifu. The Bepe Waifu + Silicon Data Center pairing exists on exactly one NFT — true 1-of-1 combo. Also has Glossed Lips + Silicon Data Center — a 1-of-1 combo. Grove-approved. 🍊",
  "3589": "At #119, this Monkey Zoo outranks 95% of the grove. The Crown speaks for itself — peak provenance, peak demand. 👑 Ranks #6 among 200 Monkey Zoos — upper tier within class.",
  "2912": "At #120, this Waifu outranks 95% of the grove. Pirate Hat on Pirate Ship — X marks this spot. Out of 250 Waifus, this sits at #10 — top 10% of the base. Pulp check: verified. 🍊",
  "2911": "Rank #121 puts this Waifu in the top 5%. Only one NFT has the Hip Hop Hat + Morning Routine combination — unique pairing alert. Ranks #11 among 250 Waifus — upper tier within class.",
  "4184": "At #122, this Bepe Baddie outranks 95% of the grove. Twin Braids + One Market is a 1-of-1 combo — no duplicates in the collection. The Vintage Dress + One Market pairing adds scarcity, only 2 exist. Citrus certified. 🍊",
  "3435": "At #123, this Papa Tang outranks 95% of the grove. Gold Teeth + Rainforest is a 1-of-1 combo — no duplicates in the collection. The best Papa Tang in existence, ranking first out of 250.",
  "4188": "At #124, this Bepe Baddie outranks 95% of the grove. Matrix Lenses in the Matrix — red pill accepted. Also has Bepe Baddie + Matrix Lenses — a 1-of-1 combo.",
  "4088": "This Bepe Soyjak comes in at #125, top 200 status. The Sonic Suit + Bepe Barracks pairing exists on exactly one NFT — true 1-of-1 combo. Out of 96 Bepe Soyjaks, this sits at #4 — top 10% of the base.",
  "4120": "This Bepe Waifu comes in at #126, top 200 status. Only one NFT has the Bepe Waifu + Pipe combination — unique pairing alert. Also has Power Bob + Bepe Army — a 1-of-1 combo. Citrus certified. 🍊",
  "3521": "At #127, this Monkey Zoo outranks 95% of the grove. Only 2 pieces have Pizza + 2Pac Bandana — scarce combo. Ranks #7 among 200 Monkey Zoos — upper tier within class. The Leather Jacket add another layer to this piece. Grove-approved. 🍊",
  "2984": "Number #128 overall — top 5% for this Waifu. Crown holders are on a different level — this trait alone is a flex. 👑 Position #12 out of 250 Waifus total.",
  "4131": "Number #129 overall — top 5% for this Bepe Waifu. The Bepe Waifu + Goose Suit pairing exists on exactly one NFT — true 1-of-1 combo. The Glossed Lips + Goose Suit pairing adds scarcity, only 3 exist.",
  "3980": "This Bepe Wojak comes in at #130, top 200 status. Within 124 Bepe Wojaks, this ranks #3 — top 3 of its kind. Solid piece with defensible traits.",
  "3140": "Number #131 overall — top 5% for this Baddie. MOG Glasses are peak face wear — collectors hunt for these. Position #11 out of 200 Baddies total.",
  "3632": "At #132, this Monkey Zoo outranks 95% of the grove. Pipe + $PIZZA together appears once in 4,200 — that's a 1-of-1 situation. Out of 200 Monkey Zoos, this sits at #8 — top 10% of the base.",
  "3179": "At #133, this Baddie outranks 95% of the grove. Sexy Lip Bite + Wizard Glasses together appears once in 4,200 — that's a 1-of-1 situation. Out of 200 Baddies, this sits at #12 — top 10% of the base.",
  "3782": "At #134, this Alien Soyjak outranks 95% of the grove. Military Beret is the second most wanted trait, and the beret stays on. Also has Alien Soyjak + $HOA — a 1-of-1 combo.",
  "3877": "This Alien Baddie comes in at #135, top 200 status. Military Beret equipped — collectors know what this means. Also has Alien Baddie + Aviators — a 1-of-1 combo.",
  "2090": "Number #136 overall — top 5% for this Soyjak. Position #4 out of 750 Soyjaks total. Solid piece with defensible traits.",
  "4157": "Number #137 overall — top 5% for this Bepe Waifu. Only 2 pieces have Bepe Waifu + $LOVE — scarce combo. The Bepe Waifu + Tiara pairing adds scarcity, only 3 exist.",
  "4199": "Number #138 overall — top 5% for this Bepe Baddie. Bepe Baddie + Tiara together shows up 2 times total — tiny supply. The Bepe Baddie + $LOVE pairing adds scarcity, only 2 exist. Grove-approved. 🍊",
  "2866": "At #139, this Waifu outranks 95% of the grove. Ronin Helmet + Prom Dress is a 1-of-1 combo — no duplicates in the collection. Position #13 out of 250 Waifus total. The Ronin Helmet add another layer to this piece. Grove-approved. 🍊",
  "3908": "Rank #140 puts this Bepe Wojak in the top 5%. Crown holders are on a different level — this trait alone is a flex. 👑 Position #4 out of 124 Bepe Wojaks total.",
  "3954": "Number #141 overall — top 5% for this Bepe Wojak. Ninja Turtle set complete — cowabunga. Out of 124 Bepe Wojaks, this sits at #5 — top 10% of the base.",
  "4115": "At #142, this Bepe Soyjak outranks 95% of the grove. Ranks #5 among 96 Bepe Soyjaks — upper tier within class. Solid piece with defensible traits.",
  "3911": "At #143, this Bepe Wojak outranks 95% of the grove. Only one NFT has the Bepe Wojak + Rainforest combination — unique pairing alert. Position #6 out of 124 Bepe Wojaks total. Clown Nose and Bepe Army round out the loadout nicely.",
  "2517": "Rank #144 puts this Soyjak in the top 5%. Price Up with Smile — bought the bottom, feeling it. Ranks #5 among 750 Soyjaks — upper tier within class. Citrus certified. 🍊",
  "4077": "Number #145 overall — top 5% for this Bepe Soyjak. Neckbeard is cultural capital. The blade has been studied. Out of 96 Bepe Soyjaks, this sits at #6 — top 10% of the base.",
  "2457": "This Soyjak comes in at #146, top 200 status. Out of 750 Soyjaks, this sits at #6 — top 10% of the base. Fake It Mask round out the loadout nicely. Pulp check: verified. 🍊",
  "3955": "This Bepe Wojak comes in at #147, top 200 status. Ninja Turtle set complete — cowabunga. Ranks #7 among 124 Bepe Wojaks — upper tier within class. Also carrying Fedora — these add depth to the profile.",
  "3086": "This Baddie comes in at #148, top 200 status. Cyber Shades + Prom Dress is a 1-of-1 combo — no duplicates in the collection. Ranks #13 among 200 Baddies — upper tier within class. Grove-approved. 🍊",
  "3098": "Number #149 overall — top 5% for this Baddie. MOG Glasses on — asserting dominance through accessories. Ranks #14 among 200 Baddies — upper tier within class.",
  "3777": "This Alien Soyjak comes in at #150, top 200 status. Clown head with Clown Nose — maximum honk mode. Solid piece with defensible traits.",
  "3132": "Number #151 overall — top 5% for this Baddie. Baddie + Golden Hour is a 1-of-1 combo — no duplicates in the collection. Position #15 out of 200 Baddies total.",
  "3701": "Rank #152 puts this Alien Wojak in the top 5%. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Also has Ronin Helmet + Crazy Room — a 1-of-1 combo. Also carrying Ronin Helmet — these add depth to the profile. Pulp check: verified. 🍊",
  "3931": "At #153, this Bepe Wojak outranks 95% of the grove. The Bepe Wojak + Cowboy Hat pairing exists on exactly one NFT — true 1-of-1 combo. Out of 124 Bepe Wojaks, this sits at #8 — top 10% of the base.",
  "3064": "This Baddie comes in at #154, top 200 status. Joint + Tiara is a 1-of-1 combo — no duplicates in the collection. Out of 200 Baddies, this sits at #16 — top 10% of the base. Also carrying Leather Jacket — these add depth to the profile.",
  "2877": "At #155, this Waifu outranks 95% of the grove. Out of 250 Waifus, this sits at #14 — top 10% of the base. Solid piece with defensible traits.",
  "3741": "At #156, this Alien Soyjak outranks 95% of the grove. That Beret carries serious weight — top-tier provenance. Also has 3D Glasses + El Presidente — a 1-of-1 combo.",
  "4180": "Number #157 overall — top 5% for this Bepe Baddie. Bepe Baddie + 3D Glasses together appears once in 4,200 — that's a 1-of-1 situation. The Mermaid Waves + Bepe Army pairing adds scarcity, only 2 exist.",
  "4198": "Number #158 overall — top 5% for this Bepe Baddie. The Bepe Baddie + $LOVE pairing only appears on 2 NFTs — low print. Solid piece with defensible traits.",
  "3958": "Rank #159 puts this Bepe Wojak in the top 5%. VR Headset + NYSE Pump is a 1-of-1 combo — no duplicates in the collection. Out of 124 Bepe Wojaks, this sits at #9 — top 10% of the base. Backing it up with VR Headset and Pepe Suit.",
  "3363": "At #160, this Papa Tang outranks 95% of the grove. Everything's Fine with Firefighter gear — when it burns, this one responds. Top 3 Papa Tang at position #2 out of 250.",
  "3846": "At #161, this Alien Waifu outranks 95% of the grove. Alien Waifu + Night Vision is a 1-of-1 combo — no duplicates in the collection. Also has Sports Bra + Moms Basement — a 1-of-1 combo. Grove-approved. 🍊",
  "3242": "At #162, this Papa Tang outranks 95% of the grove. Number #3 among 250 Papa Tangs — elite within the base. Solid piece with defensible traits.",
  "3520": "Number #163 overall — top 5% for this Monkey Zoo. White House with Trump Wave — main character energy. Ranks #9 among 200 Monkey Zoos — upper tier within class.",
  "3882": "This Alien Baddie comes in at #164, top 200 status. Alien Baddie + Twin Braids is a 1-of-1 combo — no duplicates in the collection. Also has Twin Braids + Hell — a 1-of-1 combo.",
  "4176": "Number #165 overall — top 5% for this Bepe Baddie. The Bepe Baddie + Laser Eyes pairing exists on exactly one NFT — true 1-of-1 combo. Also has SWAT Helmet + Sports Bra — a 1-of-1 combo.",
  "3832": "This Alien Waifu comes in at #166, top 200 status. Alien Waifu + Bandana Mask is a 1-of-1 combo — no duplicates in the collection. Also has Alien Waifu + Beer Hat — a 1-of-1 combo.",
  "4197": "This Bepe Baddie comes in at #167, top 200 status. Only 3 pieces have Bepe Baddie + Denim Vest — scarce combo. The Twin Braids + Orange Grove pairing adds scarcity, only 3 exist.",
  "1392": "Rank #168 puts this Wojak in the top 5%. Copium Mask + Fake It Mask is a 1-of-1 combo — no duplicates in the collection. Out of 1996 Wojaks, this sits at #4 — top 10% of the base. Backing it up with Fake It Mask and Leather Jacket.",
  "3876": "At #169, this Alien Baddie outranks 95% of the grove. The Alien Baddie + Halo pairing exists on exactly one NFT — true 1-of-1 combo. Also has Halo + Vintage Dress — a 1-of-1 combo.",
  "3104": "At #170, this Baddie outranks 95% of the grove. Centurion with Roman Drip — ave, true to Caesar. Position #17 out of 200 Baddies total. Citrus certified. 🍊",
  "2856": "Number #171 overall — top 5% for this Waifu. The Teeth + Prom Dress pairing exists on exactly one NFT — true 1-of-1 combo. Ranks #15 among 250 Waifus — upper tier within class.",
  "4195": "Number #172 overall — top 5% for this Bepe Baddie. Vixen Waves + Heaven is a 1-of-1 combo — no duplicates in the collection. Also has Vintage Dress + Heaven — a 1-of-1 combo.",
  "3099": "Number #173 overall — top 5% for this Baddie. Only one NFT has the Power Bob + Proof of Prayer combination — unique pairing alert. Ranks #18 among 200 Baddies — upper tier within class.",
  "4048": "At #174, this Bepe Soyjak outranks 95% of the grove. Everything's Fine with Firefighter gear — when it burns, this one responds. Ranks #7 among 96 Bepe Soyjaks — upper tier within class.",
  "4042": "Rank #175 puts this Bepe Soyjak in the top 5%. Military Beret is the second most wanted trait, and the beret stays on. Out of 96 Bepe Soyjaks, this sits at #8 — top 10% of the base.",
  "2918": "At #176, this Waifu outranks 95% of the grove. Halo in Heaven — this one made it. Ranks #16 among 250 Waifus — upper tier within class.",
  "2861": "This Waifu comes in at #177, top 200 status. 3D Glasses + Prom Dress is a 1-of-1 combo — no duplicates in the collection. Position #17 out of 250 Waifus total.",
  "3825": "At #178, this Alien Soyjak outranks 95% of the grove. Crown holders are on a different level — this trait alone is a flex. 👑 Also has Crown + Piccolo Uniform — a 1-of-1 combo.",
  "3052": "This Baddie comes in at #179, top 200 status. Cool Glasses + Vixen Waves together appears once in 4,200 — that's a 1-of-1 situation. Ranks #19 among 200 Baddies — upper tier within class. Also carrying Goose Suit — these add depth to the profile.",
  "3783": "This Alien Soyjak comes in at #180, top 200 status. Also has Alien Soyjak + $BEPE — a 1-of-1 combo. Solid piece with defensible traits.",
  "4178": "At #181, this Bepe Baddie outranks 95% of the grove. MOG Glasses are peak face wear — collectors hunt for these. Also has Bepe Baddie + Pepe Suit — a 1-of-1 combo.",
  "3645": "At #182, this Monkey Zoo outranks 95% of the grove. Only one NFT has the Firefighter Helmet + Rainforest combination — unique pairing alert. Ranks #10 among 200 Monkey Zoos — upper tier within class.",
  "49": "Number #183 overall — top 5% for this Wojak. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Position #5 out of 1996 Wojaks total. Citrus certified. 🍊",
  "3658": "This Alien Wojak comes in at #184, top 200 status. The Neckbeard community built half the lore here. Heritage trait. Also has Alien Wojak + $NECKCOIN — a 1-of-1 combo.",
  "3773": "Number #185 overall — top 5% for this Alien Soyjak. The Alien Soyjak + Wizard Glasses pairing only appears on 2 NFTs — low print. The Alien Soyjak + Bepe Suit pairing adds scarcity, only 2 exist.",
  "3776": "Number #186 overall — top 5% for this Alien Soyjak. Clown head with Clown Nose — maximum honk mode. The Alien Soyjak + Chia Farmer pairing adds scarcity, only 2 exist.",
  "3088": "Rank #187 puts this Baddie in the top 5%. Only one NFT has the Baddie + $HONK combination — unique pairing alert. Position #20 out of 200 Baddies total.",
  "3974": "Rank #188 puts this Bepe Wojak in the top 5%. Complete Ronin loadout — helmet, robes, dojo. The path is clear. Ranks #10 among 124 Bepe Wojaks — upper tier within class. Wizard Glasses round out the loadout nicely.",
  "3517": "At #189, this Monkey Zoo outranks 95% of the grove. Everything's Fine with Firefighter gear — when it burns, this one responds. Ranks #11 among 200 Monkey Zoos — upper tier within class.",
  "4156": "This Bepe Waifu comes in at #190, top 200 status. Bepe Waifu + Sky Shock Blue is a 1-of-1 combo — no duplicates in the collection. Also has Tiara + Sky Shock Blue — a 1-of-1 combo.",
  "3719": "Rank #191 puts this Alien Wojak in the top 5%. Bandana Mask + Piccolo Uniform is a 1-of-1 combo — no duplicates in the collection. Also has Piccolo Uniform + Moms Basement — a 1-of-1 combo.",
  "2854": "At #192, this Waifu outranks 95% of the grove. Sexy Lip Bite + Vixen Waves together appears once in 4,200 — that's a 1-of-1 situation. Position #18 out of 250 Waifus total.",
  "3039": "Rank #193 puts this Baddie in the top 5%. Denim Vest + $LOVE is a 1-of-1 combo — no duplicates in the collection. The Sexy Lip Bite + Twin Braids pairing adds scarcity, only 3 exist. Pulp check: verified. 🍊",
  "3698": "At #194, this Alien Wojak outranks 95% of the grove. Alien Wojak + Ronin appears on just 2 NFTs — collector bait. The Alien Wojak + Halo pairing adds scarcity, only 3 exist.",
  "3639": "This Monkey Zoo comes in at #195, top 200 status. Headphones + Nesting Grounds together appears once in 4,200 — that's a 1-of-1 situation. Ranks #12 among 200 Monkey Zoos — upper tier within class.",
  "3040": "Number #196 overall — top 5% for this Baddie. NPC + Ponytail together appears once in 4,200 — that's a 1-of-1 situation. The NPC + Denim Vest pairing adds scarcity, only 2 exist.",
  "4141": "At #197, this Bepe Waifu outranks 95% of the grove. The Twin Braids + Orange Grove pairing only appears on 3 NFTs — low print. Solid piece with defensible traits.",
  "4192": "At #198, this Bepe Baddie outranks 95% of the grove. Only 2 pieces have Bepe Baddie + Power Bob — scarce combo. The Power Bob + Orange Grove pairing adds scarcity, only 3 exist. Citrus certified. 🍊",
  "3699": "This Alien Wojak comes in at #199, top 200 status. Alien Wojak + VR Headset together shows up 2 times total — tiny supply. The Alien Wojak + Sonic Suit pairing adds scarcity, only 2 exist. VR Headset round out the loadout nicely.",
  "3781": "Rank #200 puts this Alien Soyjak in the top 5%. Only one NFT has the Gopher Suit + NYSE Pump combination — unique pairing alert. The Alien Soyjak + Smile pairing adds scarcity, only 2 exist. Backing it up with Cyber Shades and Gopher Suit.",
  "45": "Rank #201 — upper tier of the grove for this Wojak. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Position #6 out of 1996 Wojaks total.",
  "3513": "Rank #202 — upper tier of the grove for this Monkey Zoo. The Tyson Tattoo + $BEPE pairing exists on exactly one NFT — true 1-of-1 combo. Out of 200 Monkey Zoos, this sits at #13 — top 10% of the base. The Leather Jacket add another layer to this piece.",
  "109": "This Wojak ranks #203, landing in the top 10%. Everything's Fine with Firefighter gear — when it burns, this one responds. Position #7 out of 1996 Wojaks total.",
  "3141": "At #204, this Baddie made it into the top 420. Halo in Heaven — this one made it. Also has Wizard Glasses + Sports Bra — a 1-of-1 combo. Grove-approved. 🍊",
  "2972": "This Waifu ranks #205, landing in the top 10%. Position #19 out of 250 Waifus total. Solid piece with defensible traits.",
  "3961": "Rank #206 — upper tier of the grove for this Bepe Wojak. That Beret carries serious weight — top-tier provenance. Out of 124 Bepe Wojaks, this sits at #11 — top 10% of the base.",
  "3034": "This Baddie ranks #207, landing in the top 10%. MOG Glasses are peak face wear — collectors hunt for these. Also has Tiara + Radioactive Forest — a 1-of-1 combo.",
  "4127": "At #208, this Bepe Waifu made it into the top 420. MOG Glasses on — asserting dominance through accessories. Also has Bepe Waifu + Smile — a 1-of-1 combo.",
  "3991": "This Bepe Wojak ranks #209, landing in the top 10%. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Position #12 out of 124 Bepe Wojaks total.",
  "3150": "Rank #210 — upper tier of the grove for this Baddie. The Tin Foil Hat + Sports Bra pairing exists on exactly one NFT — true 1-of-1 combo. Also has Sports Bra + Green Candle — a 1-of-1 combo. Backing it up with Tin Foil Hat.",
  "4049": "Rank #211 — upper tier of the grove for this Bepe Soyjak. Bepe Soyjak + Tin Foil Hat together shows up 2 times total — tiny supply. Ranks #9 among 96 Bepe Soyjaks — upper tier within class.",
  "3752": "At #212, this Alien Soyjak made it into the top 420. Crown is the single most hunted trait in this collection. 👑 The Alien Soyjak + Copium Mask pairing adds scarcity, only 2 exist.",
  "3869": "This Alien Baddie ranks #213, landing in the top 10%. Alien Baddie + Joint together appears once in 4,200 — that's a 1-of-1 situation. Also has Alien Baddie + Denim Vest — a 1-of-1 combo.",
  "3518": "Rank #214 — upper tier of the grove for this Monkey Zoo. Position #14 out of 200 Monkey Zoos total. Solid piece with defensible traits.",
  "4182": "At #215, this Bepe Baddie made it into the top 420. Only 3 pieces have Bepe Baddie + Ponytail — scarce combo. Solid piece with defensible traits.",
  "3795": "Rank #216 — upper tier of the grove for this Alien Soyjak. Neckbeard is cultural capital. The blade has been studied. The Super Saiyan + SWAT Gear pairing adds scarcity, only 3 exist. The Super Saiyan add another layer to this piece. Winners win. 👑",
  "381": "At #217, this Wojak made it into the top 420. Ranks #8 among 1996 Wojaks — upper tier within class. Solid piece with defensible traits.",
  "2572": "Rank #218 — upper tier of the grove for this Soyjak. Ranks #7 among 750 Soyjaks — upper tier within class. Solid piece with defensible traits.",
  "3960": "Rank #219 — upper tier of the grove for this Bepe Wojak. The Eye Patch + Pepe Suit pairing exists on exactly one NFT — true 1-of-1 combo. The Eye Patch + Moms Basement pairing adds scarcity, only 2 exist.",
  "4007": "At #220, this Bepe Wojak made it into the top 420. Neckbeard trait means you're part of the culture — winners win. Also has Bepe Wojak + Beer Hat — a 1-of-1 combo.",
  "609": "Rank #221 — upper tier of the grove for this Wojak. Vampire Teeth + Morning Routine together appears once in 4,200 — that's a 1-of-1 situation. Position #9 out of 1996 Wojaks total. Also carrying Fedora — these add depth to the profile.",
  "3677": "Rank #222 — upper tier of the grove for this Alien Wojak. Pizza + Moms Basement together appears once in 4,200 — that's a 1-of-1 situation. The Alien Wojak + Trump Wave pairing adds scarcity, only 2 exist.",
  "4092": "This Bepe Soyjak ranks #223, landing in the top 10%. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. The Bepe Soyjak + Tin Foil Hat pairing adds scarcity, only 2 exist.",
  "4177": "At #224, this Bepe Baddie made it into the top 420. Only one NFT has the Bepe Baddie + Ninja Turtle Fit combination — unique pairing alert. Also has Bepe Baddie + Moms Basement — a 1-of-1 combo.",
  "3041": "This Baddie ranks #225, landing in the top 10%. Also has Wizard Glasses + Denim Vest — a 1-of-1 combo. Solid piece with defensible traits.",
  "3852": "At #226, this Alien Waifu made it into the top 420. Complete Ronin loadout — helmet, robes, dojo. The path is clear. Also has Alien Waifu + Eye Patch — a 1-of-1 combo.",
  "2161": "Top 10% at #227, this Soyjak is in good company. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Ranks #8 among 750 Soyjaks — upper tier within class.",
  "4043": "Rank #228 — upper tier of the grove for this Bepe Soyjak. Clown head with Clown Nose — maximum honk mode. The Bepe Soyjak + Clown pairing adds scarcity, only 3 exist.",
  "3042": "Top 10% at #229, this Baddie is in good company. Clown head with Clown Nose — maximum honk mode. The Clown Nose + Denim Vest pairing adds scarcity, only 2 exist. Citrus certified. 🍊",
  "4106": "At #230, this Bepe Soyjak made it into the top 420. The Bepe Soyjak + $PIZZA pairing exists on exactly one NFT — true 1-of-1 combo. Also has Wizard Glasses + $PIZZA — a 1-of-1 combo. Grove-approved. 🍊",
  "3940": "At #231, this Bepe Wojak made it into the top 420. Crown holders are on a different level — this trait alone is a flex. 👑 The Night Vision + God's Robe pairing adds scarcity, only 2 exist.",
  "3712": "At #232, this Alien Wojak made it into the top 420. Laser Eyes + Beanie together appears once in 4,200 — that's a 1-of-1 situation. Also has Beanie + Bepe Barracks — a 1-of-1 combo. Backing it up with Bepe Army. Grove-approved. 🍊",
  "2915": "This Waifu ranks #233, landing in the top 10%. Crown holders are on a different level — this trait alone is a flex. 👑 Position #20 out of 250 Waifus total.",
  "3724": "At #234, this Alien Wojak made it into the top 420. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. The Alien Wojak + Crazy Room pairing adds scarcity, only 3 exist.",
  "2087": "Rank #235 — upper tier of the grove for this Soyjak. The Standard Cut + Bathrobe pairing exists on exactly one NFT — true 1-of-1 combo. Position #9 out of 750 Soyjaks total. Grove-approved. 🍊",
  "3516": "Rank #236 — upper tier of the grove for this Monkey Zoo. Out of 200 Monkey Zoos, this sits at #15 — top 10% of the base. Also carrying Leather Jacket — these add depth to the profile.",
  "3757": "Rank #237 — upper tier of the grove for this Alien Soyjak. Centurion with Roman Drip — ave, true to Caesar. Also has Alien Soyjak + VR Headset — a 1-of-1 combo. VR Headset round out the loadout nicely.",
  "3932": "Rank #238 — upper tier of the grove for this Bepe Wojak. White House with Trump Wave — main character energy. Also has Bepe Wojak + White House — a 1-of-1 combo. Grove-approved. 🍊",
  "3470": "Rank #239 — upper tier of the grove for this Monkey Zoo. Military Beret is the second most wanted trait, and the beret stays on. Ranks #16 among 200 Monkey Zoos — upper tier within class. Bepe Army round out the loadout nicely.",
  "3896": "Rank #240 — upper tier of the grove for this Alien Baddie. The Alien Baddie + Propeller Hat pairing adds scarcity, only 2 exist. Solid piece with defensible traits.",
  "3803": "Top 10% at #241, this Alien Wojak is in good company. Everything's Fine with Firefighter gear — when it burns, this one responds. Also has Bandana Mask + Firefighter Uniform — a 1-of-1 combo.",
  "3656": "Top 10% at #242, this Alien Wojak is in good company. The Hannibal Mask + Chia Farm pairing exists on exactly one NFT — true 1-of-1 combo. The Alien Wojak + Fedora pairing adds scarcity, only 3 exist. The Fedora add another layer to this piece. Citrus certified. 🍊",
  "2982": "At #243, this Waifu made it into the top 420. Out of 250 Waifus, this sits at #21 — top 10% of the base. Solid piece with defensible traits.",
  "2754": "Top 10% at #244, this Waifu is in good company. Ranks #22 among 250 Waifus — upper tier within class. Solid piece with defensible traits.",
  "2955": "Rank #245 — upper tier of the grove for this Waifu. The Glossed Lips + VR Headset pairing exists on exactly one NFT — true 1-of-1 combo. Out of 250 Waifus, this sits at #23 — top 10% of the base.",
  "2013": "Rank #246 — upper tier of the grove for this Soyjak. The Astronaut + $HONK pairing exists on exactly one NFT — true 1-of-1 combo. Position #10 out of 750 Soyjaks total.",
  "3074": "Top 10% at #247, this Baddie is in good company. Only one NFT has the Alpha Shades + Ponytail combination — unique pairing alert. Also has Ponytail + Pepe Suit — a 1-of-1 combo.",
  "2478": "Top 10% at #248, this Soyjak is in good company. VR Headset + Soy Hair together appears once in 4,200 — that's a 1-of-1 situation. Ranks #11 among 750 Soyjaks — upper tier within class. Backing it up with VR Headset.",
  "4144": "At #249, this Bepe Waifu made it into the top 420. School Uniform + Moms Basement is a 1-of-1 combo — no duplicates in the collection. The Bepe Waifu + Propeller Hat pairing adds scarcity, only 2 exist.",
  "3100": "Rank #250 — upper tier of the grove for this Baddie. Terminator + Twin Braids appears on just 2 NFTs — collector bait. The Twin Braids + Proof of Prayer pairing adds scarcity, only 2 exist.",
  "3298": "Top 10% at #251, this Papa Tang is in good company. Out of 250 Papa Tangs, this sits at #4 — top 10% of the base. Solid piece with defensible traits.",
  "48": "Top 10% at #252, this Wojak is in good company. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Out of 1996 Wojaks, this sits at #10 — top 10% of the base. Wizard Glasses round out the loadout nicely. Citrus certified. 🍊",
  "3213": "Top 10% at #253, this Papa Tang is in good company. The Cool Glasses + Rainforest pairing exists on exactly one NFT — true 1-of-1 combo. Out of 250 Papa Tangs, this sits at #5 — top 10% of the base. Super Saiyan and Bepe Army round out the loadout nicely. Citrus certified. 🍊",
  "3171": "Top 10% at #254, this Baddie is in good company. Viking Armor + Moms Basement is a 1-of-1 combo — no duplicates in the collection. The Glossed Lips + Hip Hop Hat pairing adds scarcity, only 2 exist.",
  "2420": "At #255, this Soyjak made it into the top 420. Gold Teeth + Soy Hair together appears once in 4,200 — that's a 1-of-1 situation. Out of 750 Soyjaks, this sits at #12 — top 10% of the base.",
  "4183": "Rank #256 — upper tier of the grove for this Bepe Baddie. Only 5 pieces have Vixen Waves + Orange Grove — scarce combo. Solid piece with defensible traits.",
  "3976": "At #257, this Bepe Wojak made it into the top 420. Complete Ronin loadout — helmet, robes, dojo. The path is clear. The Bepe Wojak + Ronin Helmet pairing adds scarcity, only 2 exist.",
  "3659": "Top 10% at #258, this Alien Wojak is in good company. Neckbeard holder — this is grove heritage. Also has Alien Wojak + Cowboy Hat — a 1-of-1 combo.",
  "3883": "Top 10% at #259, this Alien Baddie is in good company. Alien Baddie + Vixen Waves appears on just 2 NFTs — collector bait. The Vixen Waves + Moon pairing adds scarcity, only 2 exist.",
  "2898": "Rank #260 — upper tier of the grove for this Waifu. Pizza traits on $PIZZA — every day is pizza day. Ranks #24 among 250 Waifus — upper tier within class. Grove-approved. 🍊",
  "3492": "Rank #261 — upper tier of the grove for this Monkey Zoo. The Bubble Gum + 2Pac Bandana pairing exists on exactly one NFT — true 1-of-1 combo. Position #17 out of 200 Monkey Zoos total.",
  "2766": "Rank #262 — upper tier of the grove for this Waifu. Only one NFT has the Power Bob + Born to Ride combination — unique pairing alert. Position #25 out of 250 Waifus total.",
  "3439": "Rank #263 — upper tier of the grove for this Papa Tang. Viking Helmet plus Viking Armor — Valhalla awaits. Position #6 out of 250 Papa Tangs total.",
  "3209": "This Papa Tang ranks #264, landing in the top 10%. Those MOG Glasses signal something. High-demand trait. Position #7 out of 250 Papa Tangs total. The Fedora add another layer to this piece.",
  "3635": "This Monkey Zoo ranks #265, landing in the top 10%. Screaming + $NECKCOIN together shows up 2 times total — tiny supply. Ranks #18 among 200 Monkey Zoos — upper tier within class.",
  "3744": "Top 10% at #266, this Alien Soyjak is in good company. The Alien Soyjak + Cap pairing only appears on 2 NFTs — low print. The Alien Soyjak + Born to Ride pairing adds scarcity, only 2 exist.",
  "722": "Top 10% at #267, this Wojak is in good company. Everything's Fine with Firefighter gear — when it burns, this one responds. Ranks #11 among 1996 Wojaks — upper tier within class.",
  "3948": "This Bepe Wojak ranks #268, landing in the top 10%. The Stache + Gopher Suit pairing only appears on 2 NFTs — low print. The Gopher Suit + Chia Farm pairing adds scarcity, only 3 exist. Pulp check: verified. 🍊",
  "2678": "At #269, this Soyjak made it into the top 420. Only one NFT has the Chia Farmer + NYSE Dump combination — unique pairing alert. Out of 750 Soyjaks, this sits at #13 — top 10% of the base.",
  "3851": "Rank #270 — upper tier of the grove for this Alien Waifu. Alien Waifu + Suit together appears once in 4,200 — that's a 1-of-1 situation. Also has Spikes + One Market — a 1-of-1 combo. Backing it up with Cyber Shades.",
  "2363": "Top 10% at #271, this Soyjak is in good company. Pirate Hat on Pirate Ship — X marks this spot. Position #14 out of 750 Soyjaks total.",
  "3798": "Top 10% at #272, this Alien Soyjak is in good company. Also has Alien Soyjak + Viking Helmet — a 1-of-1 combo. Solid piece with defensible traits.",
  "3515": "Rank #273 — upper tier of the grove for this Monkey Zoo. Position #19 out of 200 Monkey Zoos total. Also carrying Leather Jacket — these add depth to the profile.",
  "1975": "Rank #274 — upper tier of the grove for this Wojak. Clown + Signal Lost is a 1-of-1 combo — no duplicates in the collection. Ranks #12 among 1996 Wojaks — upper tier within class. Also carrying Fake It Mask and Clown — these add depth to the profile.",
  "3445": "This Papa Tang ranks #275, landing in the top 10%. Only one NFT has the Matrix Lenses + $NECKCOIN combination — unique pairing alert. Position #8 out of 250 Papa Tangs total.",
  "4052": "Rank #276 — upper tier of the grove for this Bepe Soyjak. Neckbeard trait means you're part of the culture — winners win. The Neckbeard + Heaven pairing adds scarcity, only 2 exist. Winners win. 👑",
  "4080": "Top 10% at #277, this Bepe Soyjak is in good company. The Neckbeard community built half the lore here. Heritage trait. Also has Bepe Soyjak + Ronin Dojo — a 1-of-1 combo. The Cyber Shades and Ronin Helmet add another layer to this piece.",
  "3815": "This Alien Wojak ranks #278, landing in the top 10%. Military Beret equipped — collectors know what this means. The Bubble Gum + El Presidente pairing adds scarcity, only 2 exist. The beret stays on.",
  "4107": "This Bepe Soyjak ranks #279, landing in the top 10%. Only one NFT has the Comrade Hat + Silicon Data Center combination — unique pairing alert. The Bepe Soyjak + Comrade Hat pairing adds scarcity, only 2 exist.",
  "2641": "Rank #280 — upper tier of the grove for this Soyjak. Those MOG Glasses signal something. High-demand trait. Position #15 out of 750 Soyjaks total. Citrus certified. 🍊",
  "738": "At #281, this Wojak made it into the top 420. Out of 1996 Wojaks, this sits at #13 — top 10% of the base. The Cyber Shades add another layer to this piece.",
  "3766": "At #282, this Alien Soyjak made it into the top 420. Alien Soyjak + $CHIA is a 1-of-1 combo — no duplicates in the collection. The Alien Soyjak + Laser Eyes pairing adds scarcity, only 2 exist. Also carrying Tin Foil Hat — these add depth to the profile.",
  "2946": "This Waifu ranks #283, landing in the top 10%. Wizard Glasses + Mermaid Waves together appears once in 4,200 — that's a 1-of-1 situation. Also has Mermaid Waves + Price Up — a 1-of-1 combo. Backing it up with Wizard Glasses.",
  "3472": "Rank #284 — upper tier of the grove for this Monkey Zoo. Full Bepe military loadout — kek's army. Out of 200 Monkey Zoos, this sits at #20 — top 10% of the base.",
  "2998": "This Waifu ranks #285, landing in the top 10%. MOG Glasses on — asserting dominance through accessories. Also has Twin Braids + Wizard Drip — a 1-of-1 combo. The Wizard Drip add another layer to this piece.",
  "3143": "Top 10% at #286, this Baddie is in good company. The Alpha Shades + Power Bob pairing only appears on 2 NFTs — low print. The Power Bob + Sports Bra pairing adds scarcity, only 2 exist.",
  "3845": "At #287, this Alien Waifu made it into the top 420. Halo in Heaven — this one made it. Also has Alien Waifu + Halo — a 1-of-1 combo.",
  "3647": "This Monkey Zoo ranks #288, landing in the top 10%. Those MOG Glasses signal something. High-demand trait. Monkey Zoo is an OG base on Chia with cultural weight built in. Citrus certified. 🍊",
  "2976": "This Waifu ranks #289, landing in the top 10%. The Vintage Dress + $LOVE pairing only appears on 2 NFTs — low print. Solid piece with defensible traits.",
  "3808": "Rank #290 — upper tier of the grove for this Alien Wojak. Ninja Turtle set complete — cowabunga. Also has Hannibal Mask + Moon — a 1-of-1 combo.",
  "4155": "Top 10% at #291, this Bepe Waifu is in good company. The Bepe Waifu + Sky Dive pairing exists on exactly one NFT — true 1-of-1 combo. Also has Glossed Lips + Sky Dive — a 1-of-1 combo.",
  "3130": "Rank #292 — upper tier of the grove for this Baddie. Only one NFT has the Copium Mask + School Uniform combination — unique pairing alert. The Baddie + Copium Mask pairing adds scarcity, only 2 exist.",
  "4071": "This Bepe Soyjak ranks #293, landing in the top 10%. Pickle Suit + Moms Basement together appears once in 4,200 — that's a 1-of-1 situation. The Bepe Soyjak + Pickle Suit pairing adds scarcity, only 2 exist.",
  "3697": "This Alien Wojak ranks #294, landing in the top 10%. Alien Wojak + Hip Hop Hat together appears once in 4,200 — that's a 1-of-1 situation. Also has Hip Hop Hat + Moon — a 1-of-1 combo.",
  "3884": "At #295, this Alien Baddie made it into the top 420. The Alien Baddie + Mermaid Waves pairing only appears on 2 NFTs — low print. The Mermaid Waves + Sports Bra pairing adds scarcity, only 2 exist.",
  "3992": "Top 10% at #296, this Bepe Wojak is in good company. Only one NFT has the Straitjacket + Moms Basement combination — unique pairing alert. The Bepe Wojak + Straitjacket pairing adds scarcity, only 2 exist.",
  "4132": "Rank #297 — upper tier of the grove for this Bepe Waifu. Matrix Lenses in the Matrix — red pill accepted. The Bepe Waifu + Propeller Hat pairing adds scarcity, only 2 exist.",
  "2940": "This Waifu ranks #298, landing in the top 10%. Copium Mask + Ponytail together shows up 2 times total — tiny supply. The Ponytail + NYSE Pump pairing adds scarcity, only 2 exist.",
  "442": "Top 10% at #299, this Wojak is in good company. White House with Trump Wave — main character energy. Out of 1996 Wojaks, this sits at #14 — top 10% of the base.",
  "2801": "Top 10% at #300, this Waifu is in good company. Also has Rugged + Denim Vest — a 1-of-1 combo. Solid piece with defensible traits.",
  "3669": "Top 10% at #301, this Alien Wojak is in good company. Complete Ronin loadout — helmet, robes, dojo. The path is clear. The Alien Wojak + 3D Glasses pairing adds scarcity, only 2 exist.",
  "4010": "This Bepe Wojak ranks #302, landing in the top 10%. 3D Glasses + $BEPE appears on just 2 NFTs — collector bait. The Pipe + $BEPE pairing adds scarcity, only 3 exist. Citrus certified. 🍊",
  "3711": "Rank #303 — upper tier of the grove for this Alien Wojak. Alien Wojak + 2Pac Bandana together appears once in 4,200 — that's a 1-of-1 situation. Also has 2Pac Bandana + Moon — a 1-of-1 combo.",
  "3859": "Rank #304 — upper tier of the grove for this Alien Waifu. Only one NFT has the Alien Waifu + Viking Helmet combination — unique pairing alert. Also has Viking Helmet + Sports Bra — a 1-of-1 combo.",
  "3700": "Top 10% at #305, this Alien Wojak is in good company. Only one NFT has the Alien Wojak + Propeller Hat combination — unique pairing alert. Also has Pipe + Moms Basement — a 1-of-1 combo.",
  "4067": "At #306, this Bepe Soyjak made it into the top 420. Stunned + Nesting Grounds together appears once in 4,200 — that's a 1-of-1 situation. The Stunned + Pepe Suit pairing adds scarcity, only 2 exist. Also carrying Pepe Suit — these add depth to the profile.",
  "4160": "Top 10% at #307, this Bepe Baddie is in good company. Vixen Waves + Moon together shows up 2 times total — tiny supply. The Bepe Baddie + Moon pairing adds scarcity, only 3 exist.",
  "3180": "This Baddie ranks #308, landing in the top 10%. Matrix Lenses + Vintage Dress is a 1-of-1 combo — no duplicates in the collection. Also has Ronin Helmet + Vintage Dress — a 1-of-1 combo. The Ronin Helmet add another layer to this piece.",
  "2504": "Top 10% at #309, this Soyjak is in good company. Pirate Hat on Pirate Ship — X marks this spot. Ranks #16 among 750 Soyjaks — upper tier within class. Pulp check: verified. 🍊",
  "3792": "This Alien Soyjak ranks #310, landing in the top 10%. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Also has Alien Soyjak + Crazy Room — a 1-of-1 combo.",
  "3393": "Top 10% at #311, this Papa Tang is in good company. Position #9 out of 250 Papa Tangs total. Fake It Mask round out the loadout nicely. Grove-approved. 🍊",
  "3078": "This Baddie ranks #312, landing in the top 10%. The Vixen Waves + Pepe Suit pairing adds scarcity, only 2 exist. Solid piece with defensible traits.",
  "3680": "Top 10% at #313, this Alien Wojak is in good company. That Beret carries serious weight — top-tier provenance. Also has Wizard Glasses + El Presidente — a 1-of-1 combo. Also carrying Neckbeard and Wizard Glasses — these add depth to the profile.",
  "2446": "This Soyjak ranks #314, landing in the top 10%. Vampire Teeth in Mom's Basement — hasn't touched grass, still winning. Position #17 out of 750 Soyjaks total.",
  "3186": "Top 10% at #315, this Baddie is in good company. The Shades + Power Bob pairing exists on exactly one NFT — true 1-of-1 combo. Also has Shades + Vintage Dress — a 1-of-1 combo.",
  "2985": "Top 10% at #316, this Waifu is in good company. Clown + Vintage Dress is a 1-of-1 combo — no duplicates in the collection. Also has Vintage Dress + Chia Green — a 1-of-1 combo.",
  "2917": "This Waifu ranks #317, landing in the top 10%. Matrix Lenses in the Matrix — red pill accepted. Also has Teeth + School Uniform — a 1-of-1 combo.",
  "2960": "Rank #318 — upper tier of the grove for this Waifu. Glossed Lips + Laser Eyes together appears once in 4,200 — that's a 1-of-1 situation. Also has Glossed Lips + Cowboy Hat — a 1-of-1 combo. Citrus certified. 🍊",
  "3101": "This Baddie ranks #319, landing in the top 10%. Pipe + Twin Braids is a 1-of-1 combo — no duplicates in the collection. Also has Proof of Prayer + NYSE Dump — a 1-of-1 combo.",
  "4024": "Rank #320 — upper tier of the grove for this Bepe Soyjak. Bepe Soyjak + Signal Lost is a 1-of-1 combo — no duplicates in the collection. The Terminator + Signal Lost pairing adds scarcity, only 2 exist.",
  "4135": "At #321, this Bepe Waifu made it into the top 420. That Crown puts you in the Royal Club — most wanted trait, period. 👑 The Bepe Waifu + Crown pairing adds scarcity, only 2 exist.",
  "3085": "At #322, this Baddie made it into the top 420. Also has Bleeding Bags + Prom Dress — a 1-of-1 combo. Solid piece with defensible traits.",
  "432": "Top 10% at #323, this Wojak is in good company. 2Pac Bandana + Viking Armor is a 1-of-1 combo — no duplicates in the collection. Out of 1996 Wojaks, this sits at #15 — top 10% of the base.",
  "3714": "Top 10% at #324, this Alien Wojak is in good company. MOG Glasses on — asserting dominance through accessories. Also has Alien Wojak + Cap — a 1-of-1 combo.",
  "4035": "Top 10% at #325, this Bepe Soyjak is in good company. Also has Bepe Soyjak + Hip Hop Hat — a 1-of-1 combo. Solid piece with defensible traits.",
  "3473": "This Monkey Zoo ranks #326, landing in the top 10%. Tin Foil Hat + NYSE Pump together appears once in 4,200 — that's a 1-of-1 situation. Monkey Zoo is an OG base on Chia with cultural weight built in. The Tin Foil Hat and Bepe Army add another layer to this piece.",
  "4091": "Top 10% at #327, this Bepe Soyjak is in good company. Trump Wave + Sports Jacket appears on just 2 NFTs — collector bait. The Bepe Soyjak + Trump Wave pairing adds scarcity, only 3 exist. Grove-approved. 🍊",
  "3116": "This Baddie ranks #328, landing in the top 10%. Pirate Hat on Pirate Ship — X marks this spot. The Screaming + Pirate Hat pairing adds scarcity, only 3 exist. The Ronin add another layer to this piece.",
  "3084": "Top 10% at #329, this Baddie is in good company. Also has Pickle Suit + Hell — a 1-of-1 combo. Backing it up with Pickle Suit.",
  "2932": "Rank #330 — upper tier of the grove for this Waifu. Sexy Lip Bite + Twin Braids together shows up 3 times total — tiny supply. Solid piece with defensible traits.",
  "1008": "Top 10% at #331, this Wojak is in good company. The 2Pac Bandana + NYSE Dump pairing exists on exactly one NFT — true 1-of-1 combo. Out of 1996 Wojaks, this sits at #16 — top 10% of the base. The Wizard Glasses add another layer to this piece.",
  "3092": "Top 10% at #332, this Baddie is in good company. NPC + Power Bob is a 1-of-1 combo — no duplicates in the collection. Also has NPC + Prom Dress — a 1-of-1 combo. Pulp check: verified. 🍊",
  "2933": "At #333, this Waifu made it into the top 420. The Cyber Shades + Sports Bra pairing only appears on 2 NFTs — low print. The Mermaid Waves + Sports Bra pairing adds scarcity, only 2 exist.",
  "3599": "At #334, this Monkey Zoo made it into the top 420. Pizza traits on $PIZZA — every day is pizza day. Monkey Zoo base carries provenance just by existing — community knows.",
  "3771": "At #335, this Alien Soyjak made it into the top 420. Also has Alien Soyjak + Fedora — a 1-of-1 combo. Solid piece with defensible traits.",
  "2772": "Rank #336 — upper tier of the grove for this Waifu. Also has Matrix Lenses + Price Down — a 1-of-1 combo. Solid piece with defensible traits.",
  "2814": "At #337, this Waifu made it into the top 420. Goose Suit on $HONK — only 4 exist. Peace was never an option. 🔥 The Sexy Lip Bite + 3D Glasses pairing adds scarcity, only 2 exist. Citrus certified. 🍊",
  "2727": "At #338, this Soyjak made it into the top 420. Clown Nose + Cowboy Hat together appears once in 4,200 — that's a 1-of-1 situation. Position #18 out of 750 Soyjaks total. Backing it up with Clown Nose and Super Saiyan Uniform.",
  "3666": "This Alien Wojak ranks #339, landing in the top 10%. Only one NFT has the VR Headset + Pickle Suit combination — unique pairing alert. The Alien Wojak + VR Headset pairing adds scarcity, only 2 exist.",
  "3029": "Top 10% at #340, this Baddie is in good company. The Ponytail + Morning Routine pairing exists on exactly one NFT — true 1-of-1 combo. Also has Chia Farmer + Morning Routine — a 1-of-1 combo.",
  "3831": "Rank #341 — upper tier of the grove for this Alien Waifu. Alien Waifu + Bathrobe is a 1-of-1 combo — no duplicates in the collection. Also has Alien Waifu + Nesting Grounds — a 1-of-1 combo.",
  "3939": "Rank #342 — upper tier of the grove for this Bepe Wojak. The Crown speaks for itself — peak provenance, peak demand. 👑 The Cohiba + Heaven pairing adds scarcity, only 2 exist.",
  "3850": "This Alien Waifu ranks #343, landing in the top 10%. Matrix Lenses in the Matrix — red pill accepted. Also has Alien Waifu + Sports Jacket — a 1-of-1 combo. Grove-approved. 🍊",
  "2397": "This Soyjak ranks #344, landing in the top 10%. Only one NFT has the Stunned + Shades combination — unique pairing alert. Ranks #19 among 750 Soyjaks — upper tier within class. The Tin Foil Hat and Ronin add another layer to this piece. Grove-approved. 🍊",
  "3662": "At #345, this Alien Wojak made it into the top 420. Devil Horns in Hell where they belong. 🔥 Also has Night Vision + Hell — a 1-of-1 combo. Leather Jacket round out the loadout nicely. Grove-approved. 🍊",
  "2919": "At #346, this Waifu made it into the top 420. Complete Ronin loadout — helmet, robes, dojo. The path is clear. Also has 3D Glasses + School Uniform — a 1-of-1 combo.",
  "3770": "Rank #347 — upper tier of the grove for this Alien Soyjak. Crown holders are on a different level — this trait alone is a flex. 👑 The Alien Soyjak + Bandana Mask pairing adds scarcity, only 2 exist.",
  "3751": "Rank #348 — upper tier of the grove for this Alien Soyjak. Devil Horns in Hell where they belong. 🔥 Also has Alien Soyjak + Devil Horns — a 1-of-1 combo.",
  "42": "Top 10% at #349, this Wojak is in good company. Crazy Room with Straitjacket and Hannibal Mask — they tried to contain this one. Ranks #17 among 1996 Wojaks — upper tier within class.",
  "3686": "At #350, this Alien Wojak made it into the top 420. Clown head with Clown Nose — maximum honk mode. The Clown + Hell pairing adds scarcity, only 2 exist.",
  "4134": "Rank #351 — upper tier of the grove for this Bepe Waifu. Also has Bepe Waifu + SWAT Helmet — a 1-of-1 combo. Solid piece with defensible traits.",
  "2777": "Rank #352 — upper tier of the grove for this Waifu. MOG Glasses are peak face wear — collectors hunt for these. Also has Sexy Lip Bite + Chia Farmer — a 1-of-1 combo.",
  "2930": "This Waifu ranks #353, landing in the top 10%. Shades + Tiara is a 1-of-1 combo — no duplicates in the collection. Also has Tiara + $CHIA — a 1-of-1 combo.",
  "3926": "Rank #354 — upper tier of the grove for this Bepe Wojak. Bepe Wojak + Devil Horns together shows up 3 times total — tiny supply. Cyber Shades and Devil Horns round out the loadout nicely.",
  "2201": "Top 10% at #355, this Soyjak is in good company. The beret stays on. Second only to Crown in demand. Ranks #20 among 750 Soyjaks — upper tier within class. El Presidente round out the loadout nicely. The beret stays on.",
  "2810": "Rank #356 — upper tier of the grove for this Waifu. The Terminator + Tiara pairing exists on exactly one NFT — true 1-of-1 combo. Also has Tiara + God's Robe — a 1-of-1 combo. Citrus certified. 🍊",
  "3093": "Top 10% at #357, this Baddie is in good company. Clown head with Clown Nose — maximum honk mode. The Clown Nose + Prom Dress pairing adds scarcity, only 2 exist.",
  "4093": "At #358, this Bepe Soyjak made it into the top 420. Only one NFT has the Straitjacket + Moon combination — unique pairing alert. The Vampire Teeth + Straitjacket pairing adds scarcity, only 2 exist. Backing it up with Cyber Shades and Straitjacket.",
  "4175": "Rank #359 — upper tier of the grove for this Bepe Baddie. Bepe Baddie + Leather Jacket is a 1-of-1 combo — no duplicates in the collection. The Bepe Baddie + Cyber Shades pairing adds scarcity, only 2 exist.",
  "2310": "At #360, this Soyjak made it into the top 420. Standard Cut + Leather Jacket together shows up 2 times total — tiny supply. Out of 750 Soyjaks, this sits at #21 — top 10% of the base. Leather Jacket round out the loadout nicely.",
  "3764": "Rank #361 — upper tier of the grove for this Alien Soyjak. Military Beret is the second most wanted trait, and the beret stays on. The Alien Soyjak + Eye Patch pairing adds scarcity, only 3 exist.",
  "3374": "At #362, this Papa Tang made it into the top 420. The Bleeding Bags + Price Up pairing only appears on 2 NFTs — low print. Out of 250 Papa Tangs, this sits at #10 — top 10% of the base.",
  "3676": "Top 10% at #363, this Alien Wojak is in good company. Neckbeard is cultural capital. The blade has been studied. The Alien Wojak + Tin Foil Hat pairing adds scarcity, only 2 exist.",
  "2068": "At #364, this Soyjak made it into the top 420. Goose Suit on $HONK — only 4 exist. Peace was never an option. 🔥 Position #22 out of 750 Soyjaks total.",
  "4118": "Top 10% at #365, this Bepe Waifu is in good company. Also has Bepe Waifu + Bathrobe — a 1-of-1 combo. Solid piece with defensible traits.",
  "4072": "This Bepe Soyjak ranks #366, landing in the top 10%. The Bepe Soyjak + Pickle Suit pairing only appears on 2 NFTs — low print. The Pickle Suit + Moon pairing adds scarcity, only 2 exist. Pickle Suit round out the loadout nicely. Citrus certified. 🍊",
  "2797": "This Waifu ranks #367, landing in the top 10%. Only one NFT has the NPC + NYSE Rug combination — unique pairing alert. Also has Denim Vest + NYSE Rug — a 1-of-1 combo. The Tin Foil Hat add another layer to this piece.",
  "3416": "Rank #368 — upper tier of the grove for this Papa Tang. Out of 250 Papa Tangs, this sits at #11 — top 10% of the base. Solid piece with defensible traits.",
  "3565": "This Monkey Zoo ranks #369, landing in the top 10%. Everything's Fine with Firefighter gear — when it burns, this one responds. The Monkey Zoo base alone has heritage value in this grove.",
  "4044": "This Bepe Soyjak ranks #370, landing in the top 10%. The beret stays on. Second only to Crown in demand. Also has Aviators + El Presidente — a 1-of-1 combo.",
  "3691": "Rank #371 — upper tier of the grove for this Alien Wojak. Joint + Devil Horns appears on just 2 NFTs — collector bait. The Leather Jacket + Moon pairing adds scarcity, only 3 exist.",
  "3226": "This Papa Tang ranks #372, landing in the top 10%. The Bandana Mask + Hard Hat pairing only appears on 2 NFTs — low print. Ranks #12 among 250 Papa Tangs — upper tier within class.",
  "3682": "Rank #373 — upper tier of the grove for this Alien Wojak. Alien Wojak + Headphones is a 1-of-1 combo — no duplicates in the collection. Also has Vampire Teeth + Headphones — a 1-of-1 combo.",
  "2343": "Top 10% at #374, this Soyjak is in good company. Stunned + Cyber Shades together shows up 3 times total — tiny supply. Ranks #23 among 750 Soyjaks — upper tier within class. The Cyber Shades add another layer to this piece.",
  "2805": "Rank #375 — upper tier of the grove for this Waifu. Halo in Heaven — this one made it. The Glossed Lips + God's Robe pairing adds scarcity, only 3 exist.",
  "2809": "This Waifu ranks #376, landing in the top 10%. Cohiba + Twin Braids together appears once in 4,200 — that's a 1-of-1 situation. Also has Cohiba + $PIZZA — a 1-of-1 combo. Citrus certified. 🍊",
  "3051": "Top 10% at #377, this Baddie is in good company. Power Bob + Goose Suit is a 1-of-1 combo — no duplicates in the collection. The Sexy Lip Bite + Goose Suit pairing adds scarcity, only 2 exist. Also carrying Goose Suit — these add depth to the profile.",
  "3433": "Rank #378 — upper tier of the grove for this Papa Tang. The Pirate Hat + Nesting Grounds pairing only appears on 2 NFTs — low print. Out of 250 Papa Tangs, this sits at #13 — top 10% of the base. The Pirate Hat add another layer to this piece. Citrus certified. 🍊",
  "3813": "At #379, this Alien Wojak made it into the top 420. Viking Helmet plus Viking Armor — Valhalla awaits. The Copium Mask + Moon pairing adds scarcity, only 2 exist. Also carrying Cyber Shades — these add depth to the profile.",
  "2702": "This Soyjak ranks #380, landing in the top 10%. The Aviators + Soy Hair pairing exists on exactly one NFT — true 1-of-1 combo. Out of 750 Soyjaks, this sits at #24 — top 10% of the base. The Super Saiyan Uniform add another layer to this piece.",
  "4147": "At #381, this Bepe Waifu made it into the top 420. Bepe Waifu + Sports Jacket together appears once in 4,200 — that's a 1-of-1 situation. Also has Mermaid Waves + Matrix — a 1-of-1 combo.",
  "2575": "Top 10% at #382, this Soyjak is in good company. Full Bepe military loadout — kek's army. Out of 750 Soyjaks, this sits at #25 — top 10% of the base.",
  "3912": "Rank #383 — upper tier of the grove for this Bepe Wojak. That Beret carries serious weight — top-tier provenance. Also carrying Bepe Army — these add depth to the profile.",
  "2270": "Rank #384 — upper tier of the grove for this Soyjak. Only one NFT has the Standard Cut + $LOVE combination — unique pairing alert. Position #26 out of 750 Soyjaks total.",
  "2800": "This Waifu ranks #385, landing in the top 10%. Rekt + Power Bob together appears once in 4,200 — that's a 1-of-1 situation. Also has Pipe + Denim Vest — a 1-of-1 combo.",
  "3146": "At #386, this Baddie made it into the top 420. Crown is the single most hunted trait in this collection. 👑 Also has Pipe + Sports Bra — a 1-of-1 combo.",
  "4019": "This Bepe Wojak ranks #387, landing in the top 10%. Also has Bepe Wojak + Spell Room — a 1-of-1 combo. The Cyber Shades and Wizard Hat add another layer to this piece.",
  "27": "Rank #388 — upper tier of the grove for this Bepe Wojak. The Neckbeard community built half the lore here. Heritage trait. Also has Bepe Wojak + Cap — a 1-of-1 combo. Cyber Shades and Leather Jacket round out the loadout nicely.",
  "3554": "Top 10% at #389, this Monkey Zoo is in good company. Crown is the single most hunted trait in this collection. 👑 Monkey Zoo base carries provenance just by existing — community knows. Also carrying MOG Glasses and Ronin — these add depth to the profile.",
  "4065": "This Bepe Soyjak ranks #390, landing in the top 10%. Military Beret is the second most wanted trait, and the beret stays on. The Ninja Turtle Mask + Bepe Barracks pairing adds scarcity, only 2 exist.",
  "3710": "Top 10% at #391, this Alien Wojak is in good company. The beret stays on. Second only to Crown in demand. Also has Military Beret + Astronaut — a 1-of-1 combo. The Neckbeard add another layer to this piece.",
  "2840": "Rank #392 — upper tier of the grove for this Waifu. Ninja Turtle set complete — cowabunga. The Waifu + Copium Mask pairing adds scarcity, only 3 exist. Citrus certified. 🍊",
  "2611": "This Soyjak ranks #393, landing in the top 10%. The Stache + Golden Hour pairing exists on exactly one NFT — true 1-of-1 combo. Ranks #27 among 750 Soyjaks — upper tier within class.",
  "3246": "Rank #394 — upper tier of the grove for this Papa Tang. Clown head with Clown Nose — maximum honk mode. Position #14 out of 250 Papa Tangs total.",
  "2375": "At #395, this Soyjak made it into the top 420. Ranks #28 among 750 Soyjaks — upper tier within class. The Wizard Glasses and Ronin add another layer to this piece.",
  "3383": "Rank #396 — upper tier of the grove for this Papa Tang. Only one NFT has the Rekt + Headphones combination — unique pairing alert. Position #15 out of 250 Papa Tangs total.",
  "2791": "Rank #397 — upper tier of the grove for this Waifu. Comrade Hat + Denim Vest together appears once in 4,200 — that's a 1-of-1 situation. Also has Comrade Hat + Hot Coral — a 1-of-1 combo.",
  "3765": "At #398, this Alien Soyjak made it into the top 420. That Beret carries serious weight — top-tier provenance. Also has Military Beret + Hell — a 1-of-1 combo.",
  "4150": "This Bepe Waifu ranks #399, landing in the top 10%. Those MOG Glasses signal something. High-demand trait. Also has Bepe Waifu + Cig — a 1-of-1 combo.",
  "64": "At #400, this Wojak made it into the top 420. Heaven background with divine traits — this one ascended. Position #18 out of 1996 Wojaks total.",
  "4009": "Top 10% at #401, this Bepe Wojak is in good company. Those MOG Glasses signal something. High-demand trait. Also has MOG Glasses + Standard Cut — a 1-of-1 combo.",
  "2758": "Top 10% at #402, this Waifu is in good company. Only 3 pieces have Laser Eyes + Orange Grove — scarce combo. The Propeller Hat + Orange Grove pairing adds scarcity, only 3 exist.",
  "3050": "Rank #403 — upper tier of the grove for this Baddie. Only one NFT has the Ponytail + Goose Suit combination — unique pairing alert. Also has Ponytail + Nesting Grounds — a 1-of-1 combo.",
  "3758": "Rank #404 — upper tier of the grove for this Alien Soyjak. Clown head with Clown Nose — maximum honk mode. The Alien Soyjak + Ronin pairing adds scarcity, only 3 exist. The Ronin add another layer to this piece.",
  "2153": "Top 10% at #405, this Soyjak is in good company. Bubble Gum + Soy Hair is a 1-of-1 combo — no duplicates in the collection. Position #29 out of 750 Soyjaks total. The Straitjacket add another layer to this piece.",
  "3184": "At #406, this Baddie made it into the top 420. The Vintage Dress + Morning Routine pairing exists on exactly one NFT — true 1-of-1 combo. The Baddie + Morning Routine pairing adds scarcity, only 2 exist. Citrus certified. 🍊",
  "2512": "This Soyjak ranks #407, landing in the top 10%. The Cig + Signal Lost pairing exists on exactly one NFT — true 1-of-1 combo. Ranks #30 among 750 Soyjaks — upper tier within class.",
  "2827": "At #408, this Waifu made it into the top 420. The Waifu + $NECKCOIN pairing only appears on 2 NFTs — low print. The Spikes + $NECKCOIN pairing adds scarcity, only 2 exist. Backing it up with Leather Jacket.",
  "4130": "Top 10% at #409, this Bepe Waifu is in good company. Halo in Heaven — this one made it. Also has Bepe Waifu + Halo — a 1-of-1 combo. Pulp check: verified. 🍊",
  "3404": "This Papa Tang ranks #410, landing in the top 10%. 3D Glasses + Moms Basement together shows up 3 times total — tiny supply. Position #16 out of 250 Papa Tangs total.",
  "3552": "Rank #411 — upper tier of the grove for this Monkey Zoo. Military Beret is the second most wanted trait, and the beret stays on. The Monkey Zoo base alone has heritage value in this grove.",
  "3693": "At #412, this Alien Wojak made it into the top 420. Only 2 pieces have Alien Wojak + NYSE Dump — scarce combo. The Alien Wojak + Fake It Mask pairing adds scarcity, only 3 exist. Also carrying Fake It Mask — these add depth to the profile. Citrus certified. 🍊",
  "3212": "Top 10% at #413, this Papa Tang is in good company. Cyber Shades + Field Cap appears on just 3 NFTs — collector bait. Position #17 out of 250 Papa Tangs total.",
  "4149": "Rank #414 — upper tier of the grove for this Bepe Waifu. The Power Bob + Suit pairing exists on exactly one NFT — true 1-of-1 combo. Also has Power Bob + NYSE Pump — a 1-of-1 combo.",
  "2562": "Rank #415 — upper tier of the grove for this Soyjak. NPC + $NECKCOIN together appears once in 4,200 — that's a 1-of-1 situation. Position #31 out of 750 Soyjaks total. Bepe Army round out the loadout nicely.",
  "775": "This Wojak ranks #416, landing in the top 10%. Out of 1996 Wojaks, this sits at #19 — top 10% of the base. Solid piece with defensible traits.",
  "3812": "Top 10% at #417, this Alien Wojak is in good company. The Alien Wojak + Trump Wave pairing only appears on 2 NFTs — low print. The Alien Wojak + Tee pairing adds scarcity, only 2 exist.",
  "3934": "At #418, this Bepe Wojak made it into the top 420. MOG Glasses on — asserting dominance through accessories. The Bepe Wojak + Everythings Fine pairing adds scarcity, only 2 exist.",
  "2939": "Top 10% at #419, this Waifu is in good company. Ninja Turtle Mask + Power Bob appears on just 2 NFTs — collector bait. The Power Bob + Sports Jacket pairing adds scarcity, only 2 exist.",
  "3553": "This Monkey Zoo ranks #420, landing in the top 10%. Ninja Turtle Mask + Rainforest is a 1-of-1 combo — no duplicates in the collection. Monkey Zoo base carries provenance just by existing — community knows. Also carrying Ronin — these add depth to the profile."
}